{
  "01-GSK 27i高端多通道数控系统 20250226": {
    "content": "--- Page 1 ---\nGor\n磨 齿 机 机 床\n一 一 一\n重庆 机 床 YS7232 高 端 多 通道 数控 系统\n应 用 领域 ‘UG GSK 27i 系 人\n适用 于 汽车 制造 船 舶 制造 风 力 发 电 矿 山 机 械 钢 铁 冶 金 YS7232 一 一\n等 领域\n用 于 加 工 汽车 变速 箱 差 速 路 传 动 轴 等 齿轮 零 部 件\n广泛 应 用 于 船舶 制造 行业 用 于 加 工 船舶 的 传动 系统 齿轮\n风力 发 电 设备 中 的 齿轮 传动 系统 也 是 磨 齿 机 的 重要 应 用 领域 一 一\n一 Yor\nBry\nIf: coe ree\nNG. 过 到 四 :三 汪 法\n人 过- ”ea 一 二\n”一 全 之\ncomm C200,\n四 二 日 日 日 内 BAB “gg\n加 工 产品 “ann 3852 332\n和 ..f ses ana aaa “nun\n一 下 一 -一 一\n了\neee\n一 rah\n数控 系统 营销 中 心 力 全 国 服务 热线\n400-0512-028 WWW.GSK.COM.N\n\n--- Page 2 ---\nGSK 27i 系 列 高 端 多 通道 数控 系\n从 和 18072\nLLL\nGSK 27i 系 列 高 端 多 通道 数控 系统 技术 特点\n党\n二 Fat, pit\noe,\nEI: 三\n一 一 口中 二 wee 网 关\nGSK-Link-PA 网 络\n二 二\nBee 网 关\n二 二 二 udu cst\nize pals\neas 支持 网 关 的 适 配 可 实现 数控 机 床 与 工\n网 scans ces 8888 S35 WALSEA. Bia)\n255 S555 S55 的 无 颖 构 建 自 动 化 生产 线\n二 二 二 see S22 一 一\naaa ana wee\nGSK-LINK 可 扩展 单元 从 站 设备\n寸 全 触 屏 寸 屏 黑 昌 面板 士 屏 独 立 式 按键 输入 /输出 点 不 再 是 瓶颈\n产品 概述\nGSK 多 通道 多 轴 联动 复 合 高 精 高 效 加 工 的 新 一 代 高 端 数控 系统 平台 全 新 设计 的 软 硬 件 平台 能 满足 复杂 精 密 上\n智能 化 设备 的 加 工 要 求 性 能 出 众 精 准 可 操 作 宜人 可 适用 车 削 铣 削 磨 沧 轮 机 器 人 等 多 种 数控 设备 一 一 一 一 一 一 一\n光栅\n支持 多 客户 端 显示 通 道 轴 控制 双 驱 同步 及 平行 轴\n高 速 高 精 复 杂 曲 面 加 工 有 效 速 度 8m/min 最 佳 加 工 速度 五 轴 刀 具 旋转 中 心 编程 (RTCP);\n4rn/min， 最 小 进 给 切削 进 给 法 向 控制 上\n支持 通道 间 轴 同 步 控制 混 合 控制 重 制 智能 化 车 间\n支持 跨 通 道 正副 主轴 位 置 同步 和 速度 同步 控制 极 坐标 插 补 功能\n具有 前 瞻 功 能 插 补 预 处 理 数 高 达 1000 段 速 度 快 精 度 高 光 圆柱 插 补 功能 角度 编码 器\n洁 度 好 垂直 度 补 偿\n支持 PLC 在 线 编辑 编 译 信 号 跟踪 功能 扩大 PLC 的 程序 容量 螺纹 切削\n高 达 8000 步 力矩 控制\n支持 USB、RJ45 通 信 接 口 实 现 文件 传输 、DNC 加 工 ，USB 在 线 多 路 径 控制 输入 电压\n加 工 端面 铣削 转换 AC380V~440V\n支持 GSK-Link 以 太 网 总 线 功能 连 接 方便 扩 展 性 强 柱 面 转换\n支持 位 绝对 式 编码 器 精 度 高 免 回 零 可 实现 全 闭环 控制 介 轴 转换 Me’\n具备 手 脉 试 切 和 手 轮回 退 功能 倾斜 轴 Ste\n支持 斗 签 式 圆 盘 式 伺 服 刀 库 等 多 种 刀 库 支持 智能 防 碰撞 检测 功能 ww. Fe:\n具备 电子 齿轮 箱 EGB 功能 人 -机 -信息 融合 数字 系统\n多 主轴 刚性 攻 丝 功能 支持 在 线 圆 度 测试 与 分 析 快 速 完成 圆 度 分 析 帮助 完成 圆 度 调试 工作 感应 电机 永 磁 同 步 电机 直线 电机 力矩 电机\nRTCP 刀 和 轴 方 向 刚 性 攻 丝 电 子 齿轮 箱 等 安全 回 退 功能 支持 密码 安全 中 心 功能 可 对 用 户 数据 进行 加 密 及 权限 管理 保 障 用 户\n支持 语句 式 宏 程序 宏 B)， 编 程 更 加 简洁 数据 安全\n具有 刚性 攻 丝 跟随 误差 诊断 界面 以 及 波形 显示 界面\nGSR\n\n--- Page 3 ---\nGSK 27i 系 列 高 端 多 通道 数控 系\n进 给 伺服 驱动 装置 HET 适 配 直线 和 力矩 电机\nbed\nSle fay aes\nGSK 列 产品 配置 GR/GM 系 列 总 线 式 伺服 驱动 单元 配 套 的 HRS.\n伺服 电机 采用 多 圈 位 绝对 式 编码 器 支 持 光栅 的 接 入 可 实\n现 高 精度 位 置 控制 tmp\n了 电\ntif\naad wre\n所\n一 直线 电机 力矩 电机\noan\n了 bah\n高 精度 主轴 定位 选 型 推荐 配置\nGSK 系列 产品 配套 机 械 式 主轴 和 高 精度 电 主轴 的 方案 成 熟 多 样 客 户 可 根据 需求 选择 配 着。\n摩擦 补偿 功能\n磁 阻 编码 器\n自 适 应 补偿 功 能 在 不 同 加 速度 下 也 能 消除 进 给 轴 换 向 时 的 痕迹\neget 分 析 结 果 a=.\n一 ae, Lae\nPose\n一 一\nFRI RN、\nais\n单元 设备\n“补偿 前 补偿 后\nGSK\n振动 抑制 功能\n检测 机 械 共振 点 频率 消 除 共振 振动 和 噪声 型 号 IOR-04T IOR-44T IOR-44F\nket\n外 观 aia\nlig\nver\n点 输入 /32 点 输出 点 入 /32 点 输出 点 给 入 /32 点 输出\n配置 低 电 平 输 出 低 电 平 输 出 高 电 平 输出\n抑制 前 抑制 后 无 模拟 电压 输出 接口 路 10V 模 拟 电压 输出 路 0~10V 模 拟 电压 输出\n90.2mm 305mm 80mm 90.2mm 305mm 80mm 90.2mm 305mm 80mm\n具备 自动 惯量 识别 功能 一 键 自动 参数 整定 功能 支 持 级 刚性 等 级 设 定 、25bit 高 分 辩 率 编码 器 宽 高 深\nGGR comics.\n\n--- Page 4 ---\nGSK 27i 系 列 高 端 多 通道 数控 系\n个 sae\n适 配 多 种 结构 五 轴 机 床\newe, cas\nFoe 加 工 满 足 客户 对 各 种 多 轴 控 制 需求 和 提高 曲面 表面 质量\n区 Bas rig\nGee ‘woes\nWii Tn”\n人“ A>:\n所 aw,\n局 部 细节 已 经 达到 了 免 的 效\n一\n双 转 台 摆 头 转台 WES\n高 速 高 精 加 工\n结构\n高 速 高 精 复 杂 曲 面 加 工 有 效 速 度 一\n8mymin， 最 佳 加 工 速度\n具有 前 瞧 功 能 高 达 1000 从 有 “一 五 轴 RTCP\n速 度 快 精 度 高 光 洁 度 好\nIRE 基于 轨迹 与 速度 规划 算法 实现 高 速 高 精度 插 补 控制\n加 工时 间 缩短 5%-30% 进 给 速 nS\"\nall HGF\n度 越 高 越 明显 采用 样 条 对 刀具 中 心 点 路 径 进行 转角 光 项 效 率 更 高 精度 更\nRTCP 关闭 RTCP 开启 RTCP 关闭 RTCP 开启\nCAM 程 序 自动\n针对 多 种 CAM 软 件 生成 的\n序 进行 自动 优化 去 除 垃圾 点 优 三 六\n化 加 工 刀 路 提 升 加 工效 果 令\n的\n和 和 人 人\n未 优化 的 刀 位 点 优化 的 刀 位 点 To.\nMDI 081883.TXT\n强大 的 多 通道 功能\n12.886— 23.673--\n多 通道 配置 TED\n通道 数 :最 大 支持 通道\n通道 轴 数 每 通道 电大 支持 个 轴\n通道 主轴 数 每 通道 最 大 支持 个 主轴 一 三 一\n通道 内 轴 置 换 通 道 之 轴 配置 互 换\n实现 GSK-Link 总 线 支持 从 站 以 上 功能 tame 避免 球 心切 削 速 度 为 零 的\n最 大 支持 个 从 站 设备 连接 及 控制 oem SEE come 情况 效 率 和 光洁 度 更 高\nEEL\nees 倾斜 面 3+2 定 位 加 工\nGsSsn GON CE, Goer OOM\n\n--- Page 5 ---\nGSK 27i 系 列 高 端 多 通道\nBEE\n一 一\n丰富 的 总 线 连接 自动 对 刀 功 能 高 速 刚性 攻 丝\n支持 GSK- Link 以 太 网 总 线 多 种 连接 方式 可 高 速 相应 点 刚性 攻 丝 回 退 倍率 可 灵活 设 首\n支持 光纤 长 距离 通讯 最 长 达到 1000 米 刀具 测量 可 适 配 则 度 及 直径 对 刀 仪 大 幅度 提升 刚性 攻 丝 效率\nMOI imma 在 多 主轴 控制 时 可 通过 选择 需要 刚性 攻 丝 的 主轴 的 选择 信号 确 定 需要 用 于 刚性 攻 丝 的 主轴\nene\n[—7 一 一 转速 倍率 xl1 ”一 “转速 倍率 X1.5\n网 线 :一 二 5000\n了 0.341 一\n“三 0.080 主轴 选择 一\n无 线 光纤 ote 2000\nO64\naim\necco\nGSK27i ee, 000 0.1 0.20.3 0.4 0,5 0.6\n一\n0.088 -3000\n(om 上 二 -4000\n-5000\n切削 进 给 法 向 控制 刚性 攻 丝 回 退 高 速 刚性 攻 多 主轴 刚性 攻 丝\n切削 过 程 中 有 旋转 轴 的 刀具 在 平 面 上 移动 时 法 线 方向 控制 功能 在 攻 丝 过 程 中 异常 中 断 可 执行 刚性 攻 丝 回 退 垂直 度 补 偿\n可 以 控制 旋转 轴 从 而 达到 刀具 始终 朝 与 刀具 垂直 的 方向 移动 可 有 效 的 避免 刀具 工 件 的 损坏\n可 进行 三 个 平面 XY、ZX、YZ 的 垂直 度 用 于 补偿 垂直 度 引 起 的 偏差 提 升 机 床 的 控制 精度\nvee Oeoeee.NC eas\n旋转 中 心 站 Mor\nmom\nmem sume [10 [semana]\name [ae 全 wen [te\n加 工 中 断 攻 丝 回 退 全 wean\n进 给 过 1699 17-10\nsee Ta: fay 49.9089\nwane\n68.0882\n刀 尖 位 置 子 208.8069\n-一 一 99.9931 Nem 49.9906\n旋转 轴 8.0128 anne\n人-\n垂直 度 不 好 导致 圆 度 不 好 使 用 垂直 度 补偿 后 的 圆 度 效 果\n双 驱 同步 及 平行 轴 控制\n极 坐 标 插 补 功能\n双 驱 同步 控制 用 一 个 轴 指 令 实现 双 轴 或 多 轴 同步 传动 进行 轴 的 力矩 模式 控制 实 现 尾 座 顶 紧 等 功能\n平行 轴 功 能 通 过 指令 切换 使 其 与 基本 轴 具 备 相 同属 性 暂时 RARE PRC RBS CIDE S96 (7) (TF\nHIS 种 方法 可 用 于 的 磨 削 例 如 基于 ATP\nAAT\n六 四\n和 二\n二 Sed\neit\nCEN\nfel,\nPina\nGSR\n\n--- Page 6 ---\n27i 系 列 高 端 多 通道 数控 系\nGSK 271 eT) Sarr\n中 间 点\n倾斜 轴 控 制\n编程 坐标 系 和 机 械 坐标 系\n颁 轴 和 正 交 轴 之 间 的 关系\n三 维 圆 补\n通过 指定 贺 中 间 点 和 终点 ,可 以 人\n(6) (倾斜 轴 BELEK\n(假想 办 人\nRA» 终点\n(X2,Y2,Z2) 机 械 坐 标 系 倾斜 坐标\n起 点 中 间 点 与 终点\n一 角 度\n圆柱 插 补 四\n回转 轴 转 换 为 直线 轴 的 下 实现 图 柱 凸 轮 本 类 的 地 件 加 工\n方便 体 的 展开 面 编程 tes\n跨 通道 正副 主轴 位 置 同步 和 速度 同步 控制\n主轴 同步 功能 可 使 主 主轴 (FS) 和 副 主轴 (LS) 以 设 定 的 转速 比 同步 运行 该 功能 具有 以 下 模式\n转速 同步 InFS\naes NS5 位 置 同步 (OFS\n110\n开 二 一\n一 一 一 Woe\n二 一\nnal 二\n199 190 27m 300 deg\nHes\n螺纹 切削\n固定 循环 指 令 编程 简 单 快捷 个 转速 同步\n等 螺 距 螺纹 变 导 程 螺纹 和 多 头 螺纹 等 多 样 化\nPosh\n自\ncance\n递交 工件 背面 加 工\nGSR conc. GSS coe et.\n\n--- Page 7 ---\nGSK 27i 系 端 多 通道\n832\nmma 1/5287\n(CREM)\n人 性 化 总 线 配置 Sat 智能 主轴 负载 自 适应\n通过 GSK-Link 实 现 所 有 进 给 轴 主 轴 和 I/O 单 元 连接 ‘wel «loan 根据 主轴 负载 大 小 自动 调节 进 给 倍率\n专用 总 线 配置 界面 可 快速 配置 从 站 设备 aa|。|=w- 恒 功率 切削 短 加 工时 间 提 高 加 工效 率\n“ro 总 站 号\nOn-\n102\nGt200-F(RI45) wes\n一\n一 come\n从 站 设置 页 主轴 负载 自 适应\n对 话 式 编程 密码 安全 中 心\n基本 运动 指令 以 图 形 化 的 格式 进行 封装 运 用 提示 和 填空 步 提 供 菜单 对 话 式 的 编程 方法 用 户 可 通过 UKey 进 行 权限 的 注册 和 管理 身 份 唯一 可 防止 密码 泄 致 系统 数据 被 恶意 改\n通过 导入 使 用 证 书 对 用 户 数据 进行 加 密 加 密 文 件 只 能 通过 对 应 的 UKey 进 行 解密 防 止 数据\nMDI 通道 vie MDI 通道 vie. Mor\noxen 好 对 从 系统 加 工程 序列 表 加 文件\nOTR cams one\nGSK 系统 当前 权限 TRACE 区 1144 NAC 149887\n下 8.0167mm meme: CNC Engineer OBSO TXT 707108 114498 SAC 14322718\n用 户 9420\n@--® 联系 地 址 WelGSKG 163.com 输入 PIN 码 308 202106 114438\nOY) 64.9883mm 64.9883mm KEY aassse rxy 202) 114498\n三 一 KEY 注 册 权 中 114438\n[1.0000 [2.00088 所 有 参数\n81.0000 Ose [10.0000 4862.cer\n[10.0000 som 四 cen\n[5.0000\n-20.0000 4.0000 后 注册 其 他 的 UKEY CN.\n5.0008\n权限 管理 界面 加 解密 操作 界面\n智能 总 线 连接 诊断 圆 度 误差 分 析 智能 防 碰 撞 检 测\n支持 总 线 诊 断 功能 可 快速 定位 总 线 连 接 故障 位 置 通过 圆 度 误 分 析 可 通过 采集 园 运行 时 数据 快 速 分 析 各 采用 深度 神经 网 络 DNN 算 法 实现 机 床 实时 碰撞 检测 功能\n面 圆 度 误差 帮 助 调试 人 员 进 行 圆 度 调试 采用 四 层 网 络 结构 在 任意 进 给 速度 下 机 床 主轴 与 加 工 台 碰 后 30ms 内 的 急 停 报警 效果\nand 241 MOI 通过 9/12 22:38; Pry\n四\n一 一 (ONS 一\n人\nmem OSS.\n一 个 Ske\nsoos SSNS Heke\n3608\nfon? Eo. 99.9946\nmy. Loe\nMie 09.0007 Che\n人 一 99.9998\nmane 2.2000\naux\n模型 结构 图 防 碰撞 检 测 功能\nANS GSK GON CE, SON OOS Ot,\n\n--- Page 8 ---\n27i 系 列 高 端 多 通道\n2x32\n通道 间 轴 控制 智能 化 车 间 管 理\n通过 多 路 径 控制 中 的 同步 控制 混 合 控制 和 重 控制 功能 可 在 路 径 间 以 及 同一 路 径 内 执行 同步 控制 混 合 控制 和 重 控 制 基于 自主 研 友 的 智能 制造 核心 技术 装备 和 工业 软件 应 用 新 技术 能 构建 “数字 化 /智能 化 工厂 ”整体 解决 方案\n同步 控制\n(1) 使 任意 的 轴 的 移动 与 属于 其 他 路 径 的 任意 的 轴 同 步 (2) 使 任意 的 轴 的 移动 与 属于 同一 路 径 的 其 他 任意 的 轴 同 步\nAIAR 应 用 移动 端 应 用\n用 路 径 的 程序 加 工 工业 物 联网 辅助 装配 ios\n大 数据 Android\n数字 化 /智能 化 工厂\n工件 二\n720521 AD) rAl OS)\n混合 控制 Bei MES 系 统\n互 换 路 径 间 任 意 各 轴 的 移动 指令 使 任意 的 轴 的 移动 指令 与 其 他 的 路 径 的 轴 重 «EO\n用 路 径 的 程序 工 tee 物料 管理\n作业 管理 车 间 物 流 出\nFX“\n设备 管理\n工\naan\nTr} aes\neine 设备 监控 数 据 采 集 、NC 程 序 管理\n用 路 径 的 程序 加 工\n二\nTCP/IP, Modus\n数控 系统 加 工 成 品\n-一\n导入 二 加 工\n有 广州 车 间 全 景\n关联 关联 1022310 vere lee\nvase suet\n人 -机 -信息 融合 数字 系统\n”二 生成\n将 实体 物件 与 数理 模型 进行 融合 构 建 数控\nURE,\n操作 及 故障 维护\n长\n自主 学 习\nDeeee CMe\n仿真 系统 仿真\nGSR www GSK.COM.CN GSR\n\n--- Page 9 ---\n了 suas\n技术 规格\n名 称 规 格 名 称 规 格\n通道 控制 功能 辅助 功能\n通道 数量 个 通道 功 能 位 数 代码 多 代 码 指令 代 码 调用 宏 程序 子 程序\n最 大 控制 轴 数 个 进 给 轴 加 个 伺服 主轴 (单个 通道 功 能 位 数\n联动 数 轴 联 动 (单个 通道 数字 主轴 模 拟 主轴 接口 10V 模 拟 电压 输出 、S5 位 数 主轴 速度 指定 多 主轴 控制 主 轴 定 向\nPLC 轴 控制 最 多 铀 (单个 通道 型 型 换 挡 刚 性 攻 丝 主 轴 倍 率 主 轴 速 度 波动 检测\n进 给 轴 同 步 控制 最 多 组 (单个 通道 精度 补偿 功能\n位 置 检测 装置 编 得 器 (绝对 式 光 (绝对 式 快速 进 给 和 切 部 进 给 分 开 补\n最 小 指令 单位 人 位 螺 插 补 型 单 向 双 向 螺 距 误差 补偿\n最 小 指令 单位 IS-C 0.0001mm 0.00001inch 0.0001\n最 小 指令 单位 IS-B 0.001mm 0.0001inch 0.001° 通信 和 数据 输入 输出 接口 功能\n最 小 检测 单位 最 小 指令 单位 JS_C 0.0001mm 0.00001inch 0.0001° 数据 接口 功能 以 太 网 、USB， 通 过 接口 可 实现 数据 传输 、DNC 和 网 络 功能\n最 大 指令 值 +999999.9999mm 上 99999.9999inch “上 999999.9999。 网 络 功能 以 太 网 通信 网 络 DNC、 远 程 监控 远 程 诊断 远 程 维 护\n最 大 进 给 速度 最 大 进 给 速度 200m/min GL200-F(RJ45) 接 线 端 子 式 DVDO: 48/48 AO: 路 0~10V\n自动 加 减速 插 补 前 直线 曲 线 加 减速 加 加 速度 控制 接 品 IOR-44T 接 线 端子 式 模拟 DVDO: 48/32 AO: 路 10V\n高 速 高 精度 加 工 具有 前 瞻 功 能 插 补 预 处 理 段 数 高 达 1000 段 IOR-44F 排 线 插 接 式 模拟 48/32 AO: 路 ,0~ 10V\n五 轴 控 制 功能 最 大 扩展 点 数 1024 点 /1024 点\nRTCP 功 能 刀具 中 心 点 控制 伺服 驱动 接口 GSK-Link 以 太 网 总 线 接口\n面 加 工 五 轴 定 位 (3+2 加 工 BRIS,\n编程 功能 适 配 增 光栅 尺 角 度 编码 器 ，TTL 方 波 信号\n区 1SO 指 令 标准 程 序 名 0+5 位 数 段 号 N+5 位 数 G+3 位 数 坐 标 值 小 数 点 前 位 后 位 PLC 功 能\nS+5 位 数 、T+3 位 、M+3 位 数 、F+ 小 数 点 前 位 后 位 内 置 PLC ,梯形 图 编程 ,在 线 动态 显示\n插 补 功能 定位 直 线 插 补 圆 插 补 圆 柱 面 插 补 极 坐标 扫描 周期 8ms， 基 本 指令 执行 时 间 0.5us/ 步\n工件 坐标 系 基本 坐标 系 G59、 附 加 扩展 坐标 系 (G54 P1-50) 组 最 大 程序 步 数 8000 步\n刀具 补偿 刀 补 功能 、255 组 刀具 补 中 间 继 电器 (R) 990 个 字 节 到 R990\n功能 回 定 循环 面 坐 标 系 旋转 比 例 缩放 镜 像 刀 具 长 度 自动 测量 刀 具 中 心 点 控制 倾 斜面 加 (DOEID255)\n工 指令 子 程序 调用 级 数 为 级 类 用 户 去 程序\n程序 存储 程序 存储 容量 为 4800M， 程 序 存储 数 虽 为 9999 个 PLC 规 格 计数 器 (C) 128 个 字 (C0 到 C127\nG27 返 回 参考 点 检查 G28 返 回 参考 点 定时 器 (T) 128 个 字 (TO 到 T127\nG29 从 参考 点 返回 G30 返 回 第 2、3 参 考点 固定 定时 器 (TB) 128 个 字 (TBO 到 TB127\n跳 过 功能 G31 过 功能 用 于 刀具 和 工件 测 PLC 报 警 (A) 个 字 节 (A0 到 A63)\n可 编程 控制 功能 可 编程 行程 极限 (G22. G23) 可 编程 数据 输入 G10 保持 型 继电器 (K) 个 字 节 (KO 到 K63)\n操作 功能 与 显示 功能 跳 转 标号 (L) 0-99\n运行 方式 选择 自动 _MDI、 编 辑 手 动 手 回 零 、DNC 了 程序 标号 (P) 0-99\n单 跳 段 机 床 锁 住 辅 助 功能 锁 选 择 停 空 运行 再 启动 急 停 超 程 释 放 循 环 启动 进\n开关 操作 给 保持 手 动 连续 进 给 单 步 进 给 快 速 进 给 刚 性 攻 丝 回 退 手 脉 试 切 主 轴 倍 率 进 给 倍率 安全 与 维护 功能\n快速 倍率 人 紧急 停止 硬 限 位 第 一 软 限 位 第 一 软 限 位 让、 第 二 软 限 位 、NC 报 器 、PLC 报 伺 服 报\n设 定 操作 刀具 长 度 补偿 测 输入 工 件 偏 测 参 数 设 定 伺 服 参数 设 定 伺 服 断 开 锁 密 码 安全 中 心\n程序 操作 SR. WOR, BHA. WR. HM. WM. (Sk. BARE. BHAA 操作 属 历 RRR.\n帮助 功能 报警 信息 解释 操 作 说 明 参 数 说 明 宏 指令 说 明 代 码 指令 说 明 、PLC 地 址 说 明 维 扩 功 能 服 负载 及 状态 监视\n英 寸 、17 英 寸 、18.5 英 寸 、21 英 寸 LCD 显 示 状 态 显示 时 钟 加 工时 间 运 行 时 间 加 工件\n数 模 信息 实 际 速 度 硬 件 软件 版 本 梯 形 图 报 信息 诊 断 信息 报 警 帮 操 作 履历 显示\ncover GSR\n\n--- Page 10 ---\n27i 系 列 高 端 多 通道 数控 系\n安装 尺寸\nGSK 27i (21 寸 全 触 屏 安 装 尺 十 GSK 27i 竖 式 才 屏 安 装 尺 十\n安装 开 孔 加 工 图\n304+0.2\n本 ARAN 5058\nco} [一 一 lad Bae boo\n478\n一 sen\nees\n二 有 mae 国 有\nhad 加\nBre\n一 Filia\n一\n四\n所 Ooo\n99900990099000]| die\n60e6 46046 V4)\nerie\n50440. 一\n>130\n一 人 77t08\n[Sai ic), feb\n一\n(6) ial 时 一 一 一 ———\nGSK 27i (17 寸 全 触 屏 安 装 尺寸\nLRA ALM RACE FARO\n一 上\nbad 去\noe: 五 轴 联 动机 床\neum Ail] TRONC-YK1250B\n中 一 下 人\n12-08 ool 实现 内 燃 机 动力 零 部 件 曲轴 连 杆 铸 锻件 精 加 工\n——— 人\n265.278 127,540.15, 太一\n222\nEEE\n应 用 效果\nfee 局\nane can 一\n使 用 GSK 控 系 统 控制 轴 联动 控制 旋 转轴 圆 光 栅 闭\n-一 环 控制\n实现 密码 安全 中 心 功能 防 止 数据 泄漏\n115 37741 aes\n实现 数字 化 车 间 管理 缩 短工 件 生产 时 间 提 高 生产 效率\n一 一 一\nGBR GSK\n\n--- Page 11 ---\nGSK 27i 系 列 离 端 多 通道 数控 系统\n本 27i series high-end multi-channel CNC 三 一 444 wax\n六 二 人\n四 通道 多 工 位 高 效 精密 机 床 九 轴 五 联动 车 铣 复合\n戴 杰 B2000 本 大 连 机 床 B70ST\nml:\nFER 支持 双 通 道 同 步 车 削\n实现 加 工 圆 柄 类 工具 如 整体 铣 刀 、IT 刀 具 木 工 刀具 医 疗 五 轴 RTCP 功 能\n一 一 工具 头 和 等 孔 加 工 刀具 的 加 工 最 高 可 实现 通道 主 轴\n通道 配备 双 刀 仓 主 仓 刀 位 副\n仓 思 位\noe.\nate tied 应 用 效果\n应 用 效果 一 一 一 一 一\n一 一人 人 一\n支持 双 通 道 同步 车 削\n此 案例 使 用 GSK 控 系统 控制 最 大 支持 通道 每 通道 最 大 支持 个 轴 通 道 主轴 数 每 通道\n配套 数控 工具 磨床 定 制 开发 刀具 磨床 界面 实 现 通道 通 最 大 支持 个 主轴 小 人\n道内 配 置 五 轴 RTCP 功 能\n最 大 个 轴 数 带 力矩 控制 的 固定 点 停止 功能\n品行\n成 直径 210mm 的 刀 起 到 节约 材料 的 作用 端面 铣削 转换 柱 面 转 换 斜 轴 转 换 定 向 转换 及 相互 级 联\n在 刀具 检测 界面 中 输入 各 轴 的 探测 起 点 及 工艺 数据 系 统 自动 主轴 速度 及 位 置 同步\nSADR 通道 间 程 序 同步\n在 刀具 检测 界面 中 输入 加 工 参数 系 统 自动 生成 加 工程 序 节 -一 跨 通道 取 进 给 轴 主 轴 通 道内 轴 配 置 换 通 道 之 间 轴 配置 人\n省 手动 编程 时 间 缩 短工 件 生产 时 间 提 高 生产 效率 aie:\n272\n方式 削 齿轮 电子 齿轮 箱\n实现 GSK-Link 总 线 支持 从 站 以 上 功能 :最 大 支持 个 从 站\n设备 连接 及 控制 一 -一\n加 工 成 品\n一 区 一\nprc\nite\neee\nboy tow 中\ninne Ms, 一\n太一\npee\n由 人\nwets\n有\nI-A 一 到 ane\n一 一\n\n--- Page 12 ---\n数控\n和 近 ars\n使 本\nSpe\n高速 高 精 卧 式 加 工 中 心 龙门 加 工 中 心 由 斑\n四\n青岛 云 科 SH50 山东 有 荣 喜 力 XH2519\nweeg 881 可\nsees 一 一 用\n1580 off: 人\namen 有\n二 二\nWee\nTTT\n一 YOURONGXLis\nAen,\n一\n应 用 领域\n适用 于 汽车 模 具 造 鹏 机 电 机 床 印 刷 轻 纺 等 各 种\n机 械 制作 业\n主要 用 于 中 小 型 零件 模 具 等 多 种 加 工 工 件 一 次 装 夹 后 自\n动 高 效 高 精度 的 连续 完成 钻 锋 较 等 多 侧面 多 工 应 用 领域\n序 的 加 工 加 工 实现 程序 化 缩 短 了 生产 周期 从 而 使 用 户 一\n获得 良好 的 经 济 效益 有 XH2519 型 立 式 定 梁 数控 龙门 加 工 中 心 是 一 款 具 有 高 刚性 的 结\n构 设计 可 靠 的 精度 稳定 性 及 保持 性 的 机 床 广 泛 应 用 于 机 械 制 造 行业 人\n各 种 板 类 箱 体 类 机 架 类 等 复杂 字 件 的 粗 精 加 工\n一\nfo\" RIN\nom’\nQe!\nWee ori:\nera Tre\nSLY\nLOS o__@\n发 动机 拭 体 钻 攻 类\n材料 全\nISK GSn",
    "file_path": "D:\\llm-test\\QAGenPipelinesX_lightrag\\working\\processed\\01-GSK 27i高端多通道数控系统 20250226.txt",
    "create_time": 1764297679,
    "update_time": 1764297679,
    "_id": "01-GSK 27i高端多通道数控系统 20250226"
  },
  "01-宝鸡机床VMC850L": {
    "content": "--- Page 1 ---\nmoot\nCommand the Future_ VMC8S50L VMC850L TECHNICAL PARAMETERS\nCOMMAND THE FUTURE\n项 目 单位 VMC850L\n工作 台面 尺寸 长 宽 1000 500\n行程 X/Y/Z 800/500/600\n人 600\nSOS 一 -一 主轴 端面 至 工作 台面 距离 86-686\n主轴 中 心 至 立柱 导轨 距离 560\n一 留 一 主轴 锥 孔 BT40\n主轴 电机 功率 7.5\nVMC 4501 主轴 转速 r/min 8000\nX/Y 线 轨 台湾 线\nBOZHI X、Y 、2Z 轴 快速 移动 偿 m/min 24/24/15\n刀 库 类 型 24-T/ 圆 盘\n了 机 床 外 形 尺 寸 (长 高 帘 2800 2450 2800\n‘al mit 争 重 约 6500\n到\n有\nin:\n多\n一 一\nAER 名 优 产品 质量 稳定\nPURI MAA, (SESH,\n除 工序 使 得 机 床 具 有 良好 的 刚性\n整 机 针对 高 速 高 刚性 专门 设计 主 轴 最 高 转速 达 8000wmin,X/Y 采 用 滚珠\n线 轨 轴 超 宽 硬 轨 ，XY 轴 快速 移动 达 24my/min，Z 轴 快速 移动 15m/min CLASSIC sna\n采用 配 重 平衡 系统 机 床 高 速 动态 稳定 性 好\n主办 及 工作 台面 的 方面 专 有 技术 保 证 了 其 硬度 和 精度 HOT SELLING\n定性\n加 工 中 心 关 键 零件 和 出 三 精 度 均 由 美国 布朗 夏普 BROWN SHARPE\n三 坐标 测量 和 英国 雷 尼 绍 RENISHAW 双 频 激光 干涉 仪 严格 检测 对 其 进\nseman COMMAND THE FUTURE\n热卖 爆 款 名 优 产 品 质量 稳定",
    "file_path": "D:\\llm-test\\QAGenPipelinesX_lightrag\\working\\processed\\01-宝鸡机床VMC850L.txt",
    "create_time": 1764298314,
    "update_time": 1764298314,
    "_id": "01-宝鸡机床VMC850L"
  },
  "01系统综合-铣削": {
    "content": "--- Page 1 ---\n售后 技术 支持 营销 服 务 网 络 估 后 人 员 到 位 率\nal. Lo}\n精益 求 精 让 用 户 满 总 近 280 人 人 pene 18032\n国外 办 事 处 人 小 时 内 99.5%\n全 国 服务 网 点\n华南 -c:\n广东 广州 办 事 处 浙江 西 店 办 事 处 华中 ”一\nFAIZ. 13808892746 电话 13884452605\n地 址 CHAP 地 址 ABBTEH 湖南 ”长沙 办 事 处\n广东 江门 办 事 处 浙江 ,宁波 办 事 处 电话 ，13787227355 one\niE. 13822335946 wi. 13732118020 地 址 湖南 省 长 沙市 雨 花 区 圭 塘路 新 星 小 区 梅 星 范 栋 单 元 106\n地 址 地 址 1003\n上 处\n广东 浙江 RMN 一 一\n电话 13822282126 电话 13616568939 一\n地 址 武汉 市 武昌 区 小 区 二 期 单元 层 室\n地 址 东 市 长 安 镇 锦江 花园 锦 湖 楼 202 地 址 浙江 省 市 阳 明 公 寅 102 PREIS 一\n浙江 ,杭州 办 事 处\n广西 电话，18858273927 电话 ，13907270651\n话 地 址\n联系 电话 :13977280656 地 址 SLANE LUE wore”\n地 址 柳州 市 飞 路 利 民 区 单元 号 浙江 ROBIE 河南 郑州 办 事 处\n电话 13758518391 Bis: 13808874681\n华东 地 址 诸 是 市 店 口 池 江东 路 临 江 花园 性 单 元 401 地 址 :郑州 市 二 七 区 西 陈 庄 前 街 号 院 BBE 号 楼 单元 102\n上 海 办 事 处 浙江 富阳 办 事 处 六\nais. 13808824702 Bi: 15805712468 西南\n地 址 Aaa are Coe\n地 址 上 海 市 松江 区 荣 乐 中 路 120 弄 号 201 室 sy?\n海 市 松 路 重庆 办事 处 hep ete 人\n江苏 办 事 处 电话 ，13957324866 电话 13883145869\n电话 ，13961838115 地 址 1001-18\n地 址 fe,\nwet 四 川 成 都 办 事 处\n电话 13805213538 电话 13808844370\n地 址 江苏 省 徐州 市 云龙 区 和 平 大 这 尚 仕 号 机 1504 电话 ，18559950945 HEME: 成 都 市 成 华 区 双 庆 路 号 二 栋 单 元 902\n地 址\n江苏 MHD 云南 昆明 办 事 处\nwi, 15851936363 放 办 下 wi. 13808795180 THE FUTURE\n地 址 常州 市 天 宁 区 竹 新 村 北 区 157 单 元 102 室 159480880198 tht. 1078\n江苏 南京 办 事 处 地 址 :泉州 市 前 坂 新 村 西区 栋 201 室\n电话 13645157082 华北\nht. 江苏 省 南京 市 栖霞 区 网 板 路 号 金 纺 园 二 单元 403 室 江西 \"上 办 事 处\n江苏 BHD wet 电话 13687038379 河北 石家庄 办 事 处\n电话 15895728321 地 址 ;上 市 带 湖 路 号 电话 13784331918\n地 址 SAA 108305 东 户 ht, 河北 省 石家庄 市 桥 西 区 新 石 中 路 号 枉 园\n江苏 南通 办 事 处 河北 任 丘 办 事 处 woe aes\niE. 13646260011 电话 15155115728 电话 15076767218 汪\nHAD MRS 10068 地 址 河北 省 任 丘 市 金 台 园 小 区 号 楼 一 单元 903 six\n江苏 盐城 办 事 处 安徽 河北 沧州 办 事 处\niS. 13851180443 电话 18855319358 电话 18333056012\n地 址 ;盐城 市 事 湖 区 文 港 路 五 星 小 区 康 居 范 301 室 地 址 安徽 省 芜湖 市 镜 湖区 荣 华 府 一 单元 601 地 址 河北 省 沧州 市 运河 区 西 环 中 街 街道 河 新 城 东区 号 楼 -1-2202\n江苏 苏州 办 事 处\n天 津 办 事 处\niE, 15850005239 山东 青鸟 办 事 处 上\n地 址 电话 13808997916 aif 381. 2000-\n地 址 ”青岛 市 市 北 区 后 仁 路 号 二 单元 201 户 地 址 市 东 区 新 立 街 津 寺 路 北 便 6-1-401 Fee ees\n浙江 玉环 办 事 处 山东 烟台 办 事 处 辽宁 沈阳 办 事 处 加 eRe aes\n电话 13600576658 电话 13808843497 电话 ，13840399307 osoo 一 一 一 一 一 一\n地 址 浙江 省 台州 市 玉环 玉 城 街道 蓝天 花 范 单元 204 地 址 山东 省 烟台 市 军区 前 进 路 西 供销 园 8-6 地 址 沈 阳 市 沈河 区 八 号 ‘ame een\nSane\n温 的 办 事 处 山东 潍坊 办 事 处 辽宁 办 事 处 aagnooo\nRZ, 13665785170 电话 13869602619 电话 ，13804081812 上 上 上 :二\n地 址 浙江 省 温岭 市 太平 街道 东 小 区 栋 一 单元 401 山东 省 潍坊 市 城 区 安顺 路 6369 号 海 化 阳光 园 16-1-301 地 址 辽 宁 省 大 连 市 西 区 大 公 街 层 sana!\n浙江 路 桥 办 事 处 县 州 办 事 处 an: See\n电 适 13750620308 电话 18266012329 西北 sees set\n地 址 台州 市 路 桥 区 路 北 银 安居 银 安 小 区 栋 101 房 地 址 州 市 河 街道 照 城 国际 人 金 园 号 楼 一 单元 1404 二 有 mgooaeucaat nncu acuo wie\n浙江 温州 办 事 处 山东 济南 办 事 处 陕西 .西安 办 事 处 工党 wuun\n电话 13615779918 电话 13853119376 电话 13892899172 hoy 名 ‘age\n地 址 温州 市 区 永 兴 街道 下 街 670 号 地 址 山东 省 济南 市 天 桥 区 无 山路 48- 号 美 林 大 大 楼 708 地 址 陕西 省 西安 市 区 十 路 金 挫 青 家 园 东 区 栋 单元 201 室\n浙江 永康 办 事 处 山东 华北 技术 中 心 RIED\n电话 13566755677 电话 13318722875 电话 13892756212\n地 址 浙江 省 未 康 市 古 丽 镇 牟 店 石 西 路 376 号 地 址 山东 省 济 市 天 桥 区 无 影山 路 48- 地 址 西 省 宝鸡 市 高 新 区 高 新 大 道 199 号 阳光 上 东 小 区 单 元 406\n公 司 GSK\n一 machine tool CNC system\nCOE\nGSK CNC EQUIPMENT CO..LTD. 年\nPrecise Control High Efficient and Stable\n数控 系统 营销 中 心 免费 保\n地 址 广州 市 萝 岗 区 观 达 路 号 邮编 510530 ries FEAT 综合\n网 址 www.gsk.com.cn aaa 木\n总 机 400-0512-028 (020)81786477\n销售 热线 (020)81990819 81986922\n传真 (020)81993683 Weer 总\n四\n全 国 服务 热线 (020)81798010( 一 号 多 线 广 数控 官方\nfood\n\n--- Page 2 ---\n一 打造 百年 企业 铸就 金 质 品牌 eee 一\n关于 我 们\nCATALOGUE\n三\nBFS\n设备 有 限 公 有 一\nior 铣削 数控 GSK 25i 系 列\nSegoe\nGSK CNC EQUIPMENT CO.LTD. 日 CSIC\nGSK 988MA 系 列\n(GER. 广州 数控 、GSK) eae GSK 980MDi\n心 致力 于 基础 装备 产业 发 展 的 研究 与 实践 专 业 提 GSK 980MDc\n供 机 床 数控 系统 伺 服 驱 动 伺 服 电机 “三 位 一\n体 ”成 套 解决 方案 同 时 积极 拓展 工业 机 器 人 及 全 第 一 园区 -中 国 南方 数控 产业 基地 车 削 数控 系统 GSK988TD\n电动 注塑 机 领域 开 创 机 床 展厅 营销 新 模式 ,为 客 GSK 988TA\nSer\n融合 开 设 职业 音 训 学 院\n高 技能 数控 技能 人 才 培 训 已 发 展 成 为 一 家 集 科 SIC \"18\n教 工 贸 于 一 体 的 高 新 技术 企业 被 誉 为 “中 国 eee GSK 980TTC 131\n南方 数控 产业 基地 GSK 980TDc 138\nGSK 980TC3\n二 园区 -精密 加 工 配 第 三 园区 -机 器 人 产业 园 (建设 中\n第 一 区 件 四 人 GSK 980TB3i 161\nGSK 980TB3 174\nGSK 928Ti 179\n资质 GSK 928TD-L 185\nHONOR AND AWARDS GSK 928TA2 191\n磨 削 数控 系统 GSK 986G/GSK 986GS 195\n书 GSK 980HC 205\n齿轮 加 工 数控 系统 GSK 25jiG 211\naoe\n木工 机 械 数 控 系 统 GSK 988W 216\nGSK 980MDc( 木 工 226\n国家 科学 技术 进步 国家 科学 技术 进步 奖 制造 业 单项 冠军 示范 企业 中 国 机 床 工具 工业 协会 第 九 届 理 事 全 GSK 920D-L 231\n轮值 理事 长 单位\n自动 化 产 线 控制 系统 GSK GPC1000A 237\n国家 地 方 联 台 国家 认定\n工程 研究 中 心 企业 技术 中 必 多 功能 位 置 控制 系统 GSK\n伺服 驱动 单元 GSK 系列 247\n国家 地 方 联合 工程 研究 中 国家 认定 企业 技术 中 机 械 工业 -高 性 能 电机 及 驱动 机 械 工业 -机 数控 系统 GSK 系列 253\n工程 技术 研究 中 心 可 千 性 技术 工程 实验 室\n伺服 电动 机 GSK SJT 系 列 259\n者 GSK 2ZJY 系 列\nNRE BOE 作 站 ale GSK DZY 系 列 329\nAut Sone TAT manny: mas\n“EO GSK\nFeta GSK SJM 系 列 357\n国家 规划 布局 内 博士 后 科研 工作 站 高 新 技术 企业 国家 机 器 人 标准 化\n重点 软件 企业 证 书 总 体 组 成 成 员 单位\n\n--- Page 3 ---\n25i 系 妨\nSee 12032\nsae\nGSK 235i 系 列 数 控 系 统 适用 控制 设备 类 型\nGSK\n改进 研制 的 新 一 代 高 性 能 高 可 靠 性 CNC 系 统 产 品 功能 强 于 立 式 加 工 中 心 五 轴 联 动 加 工 中 心 五 轴 工 具 磨床 木工 加 工 机 床\n大 操 作 方便 适 用 范围 广泛 one 卧 式 加 工 中 心 复合 工艺 加 工 机 床 外 圆 轮 磨床 石材 加 工 机床\n新 一 代 CNC 控 制 器 更 快 的 数据 处 理 速度 更 高 的 系统 稳定 龙门 加 工 中 心 数控 铣床 平面 磨床 激光 加 工 机 床\n性 更 强 的 控制 功能 ,多 轴 联 动 总 线 控制 高 速 高 精 绝 对 式 编 总 seoe 有 钻 攻 中 心 车 削 中 心 专用 组 合 机 床 朱 摩擦 焊接 机 床\nGRA\n码 器 铣 机 立 式 数控 车 床 自动 化 设备\nGGG8\n横 式 10.4 寸 屏 独 立 按键\nSEE Saye: 先进 的 硬件\n一 GSK\naes AAS 应 硬件 平台 全 新 一 体 化 低 功 耗 快 散热\n#00 See 免 维护 纯 金 属 结构 机 箱 坚 耐用 抗 干扰 aia\nees see roe\nose 性 极 高 搭 配 独 立 式 按键 设计 更 美观 触 感\nSes wen\nane ase 更 佳 人 机 交互 体验 更 好 zh:\nGee\nces SHORE GMM aes\n吕\n日 加 相国 四 RMNMN 区 mene 进 给 驱动 光栅\nswan\n日 人 AS,\nSHE\n模式 8.4 寸 屏 独 立 按键\nGSK-Link-PA 网 络\n2017 年 第 一 届 全 国 智能 制造 大 赛 指定 系统 “ax Gpc10o0\n国家 科技 重大 专项 成 果 第 四 届 全 国 数控 大 赛 五 轴 项 目 指定 系统 军 选 手 使 用 系统\n第 六 届 全 国 数控 大 赛 五 轴 四 轴 项 目 指定 系统 冠 军 选手 使 用 系统\n25iMc 系 列 存储 空间 从 25iMb 的 511MB 扩\n容 至 4GB 以 上 满 足 现 阶段 广大 用 户 大 文 25iM< 与 25iMb 革 本 性 能 指标 对 比\n该 系列 产品 已 在 航空 航天 汽 车 制造 件 存储 需求\n能 源 动力 五 金 模具 、3C 等 行业 广泛 应 用 77?” .<。\n为 各 行业 提供 高 效 精 准 的 运动 的 控制 及 了 1.7 秒 缩减 至 0.6 秒 处 理 效率 提升\nRV, TTT\n25iMc 系 列 系统 启动 时 间 从 25iMb 系 列 的\n17ms\n秒 缩短 至 秒 减 少 用 户 等 待 时 间 提 ees\n升 用 户 体验\n\n--- Page 4 ---\n25i 系\nSSK25i 系 列 数控 系统 444\n技术 特点\n强劲 的 功能 贺 度 误差 分 强劲 的 功能 坐标 分 中 强劲 的 功能 五 轴 联 动 加 工\n一 键 采集 现场 实际 圆 度 并 和 预 设 标准 贺 进 移动 进 给 轴 并 读 取 工 伯 轮 点 快 速 完成 点 分 中 轴 联 动 支 持 多 种 类 型 的 五 轴 机 床 结构 适 合 航空 发 动机 汽 轮机 叶片 模 具 等 多 轴 零件 的 加 工 具 备 五 轴 RTCP( 刀 具 中 心 点 控\n行 对 比 误 差分 析 实 现 数据 可 视 化 辅 支持 对 刀 块 高 度 预 设 制 倾 斜面 (3+2 定 位 加 工 五 轴 具 路 径 光 顺 功能 五 轴 侧 刃 加 工 的 进 给 速度 自 适应 控制 五 轴 手 脉 插入 等 功能 满 足 客户 对\n助 圆 度 调 试 简 化 调试 步骤 最 大 程度 保护 工件 表面 同 时 简化 用 户 计算 各 种 多 轴 加 工 的 功能 和 加 工 质量\n支持 PID、 伺 服 反馈 光 山 馈 与 指令 共 支持 个 标准 工件 系 及 个 扩展 工件 坐标 系\n种 数据 来 源 支持 矩形 及 圆 形 两 种 常规 工件 外 形 轮廓 坐标 分 中 RTCP 关闭 RTCP 开启 RTCP 关闭 RTCP 开启\nCee) eee)\ncome |v. ca) tone fe,\n‘ain: meen 1.92\n-十 这 编程 路 径 /控制 点\n是 wet\name wis:\nals XY?\n刀 尖 路 径 编程 路 径\ndee\nam] Bal] au) ese au) xan] eve\n支持 的 五 轴 机 床 结构\n人\n强劲 的 功能 wasn 强劲 的 功能 五 轴 加 工 的 进 给 速度 自 适应 控制\n一 键 加 载 对 应 轴 选 REN 文 件 即 可 快速 完成\n螺 补 参数 设 定 及 螺 补 数据 写 入 An’ 区\n用 户 可 根据 实际 需求 进行 一 键 增 量 加 载 以 人 Se.\n达到 修正 补偿 的 效果 Ges 小\nBit\n实现 螺 补 参数 及 数据 零 操作 完 全 避免 人 刀具 侧 丸 加 工 效 率 更 高 避免 球 心切 削 速度 为 地 的\nAIT 情况 效 率 和 光洁 度 更 高\n控 数 据 正 确 率\nLSE 材料 切除 率 的 实时 变化\neran 支持 的 五 轴 机 床 结构\naed\nime\nmee\n上\ncom\n色\n-一 二\n只 了\n过\n三\n刀 轴 光 顺 优化 表面 质量 中\n\n--- Page 5 ---\n经 多\n技术 特点 技术 特点 横向 进 给 控制 (G160、G161) 一 一 nits aia\n强劲 的 功能 五 轴 定 位 加 工 强劲 的 功能 智能 工厂 网 络 -一 SSS 二 振荡 直接 园 定 尺寸 削 循环 G74\n用 户 只 需 通过 代 码 简单 快捷 的 设 定 特征 坐标 系 系 统 可 自动 实现 加 工 零件 的 空间 坐标 系 变换 用 旋转 轴 定位 加 工 平 面 然 后 进行 五 通过 将 接 入 网 络 构 建 智能 工厂 网 络 系 PLM、ERP 系 统 高 速 高 精 加 工 光 顺 处 理 无 高 速 高 精 加 工 有 高 速 高 精 加 工\n轴 定 位 加 工 适 用 于 所 有 空间 平面 变换 的 零件 加 工 管 理 分 散在 生产 现场 的 CNC 制\n实现 数据 采集 文 件 传送 远 程 监控 和 故 FTP 数 据 服务 器\ngle 障 诊断 维 护\nEs)\njew FTP 方 式 效 据 文件 远程 监控 工艺 技术 生产 调度\n传送\n和\n通过 网 络 实现\n程 序 管理 传 送\n倾斜 面 3+2 定 位 加 工 大 时 监控 设备 运行\n远程 维护\n工厂 运营 数据 采集 处 理\n强劲 的 功能 高 速 高 精 加 工 295 332\n速度\n1000 段 程序 前 插 补 前 直线 加 减速 插\n补 前 型 加 减速 插 补 后 型 加 减速 加 速\n度 加 加 速度 控制 实现 平滑 给 多 种 在 线 轨 强劲 的 功能\n迹 光 顺 模 式 能 兼顾 不 同类 型 加 工 的 效率 和 LEY\n表面 质量 横向 磨 削 循环 (G71)\n插 补 前 型 加 减速\n横向 直接 固定 尺寸 磨 削 循环 G72)\nies\note 经 水\n加 工时 间 普通 模式 GO5P3 摆动 磨 循环 G73) 电\n进 给 速度 摆动 直接 固定 尺寸 削 循环 (G74) «-------------4 «-----------~-4\nF5000 小 时 分 分 切入 式 磨 肖 循环 G75\n纵向 走 刀 直接 固定 尺寸 麻衣 (G72) 纵向 走 刀 磨 削 循环 (G71)\n切入 式 直接 恒定 尺寸 循环 (G77)\n连续 进 给 表面 麻衣 (G78)\nfoe, (a) (G79)\n异步 震荡 磨 削 (G101)\n\n--- Page 6 ---\n技术 特点 技术 特点\n强劲 的 功能 自动 工件 刀 具 测 量 强劲 的 功能 法 线 方向 控制 功能 G150/G151 强劲 的 功能 卡 盘 尾 座 屏障\n集成 知名 厂家 自动 测量 软件 可 实现 自动 工件 找 正 工 件 测量 和 切削 中 X、Y 轴 的 移动 轨迹 控 制 旋转 轴 使 刀具 朝向 保持 在 轨迹 可 以 根据 卡 盘 及 尾 架 的 形状 利 用 专用 的 设\n动 刀具 测量 法 线 方向 与 刀具 的 行进 方向 相 垂直 的 方向 的 功能 定 画面 来 事先 设 定 一 个 刀具 进入 禁止 区 加\n工时 如 果 刀 尖 进 入 该 进入 禁止 区 该 功能 可 [oy\n使 刀具 停止 移动 并 显示 报警 信息 可 从 沿 进\n给 的 相反 方向 把 刀具 从 禁止 区 中 移 走\n(ees seme\nsom\nBoome\nARCH\n人 性 化 操作 界面\n和 二 次 三\n强劲 的 功能 位 同 步 /力矩 耦合 同步 轴 控 强劲 的 功能 特殊 代 码 固定 循环 根据 人 的 行为 习惯 思 维 方式 等 等 在 原 有 eee\n设计 基本 功能 和 性 能 的 基础 上 增 加 各 种 便\n两 台 或 多 台电 机 同步 驱动 一 主 一 从 工作 从 动 轴 跟随 主动 轴 标准 代 码 的 基础 上 增加 各 种 各 样 的 代 码 满 足 各 种 用 户 的 特殊 于 操作 的 对 话 式 编程 和 丰富 的 提示 信息\n可 实现 最 多 组 同步 轴 的 控制 需求 实 现 简易 快速 编程 和 解决 复杂 的 加 工 任务 效 的 提高 用 户 手工 编程 的 速 使 用 户 操作 起\n来 非常 方便 舒 适\nbay Eee)\nSars 人\neee\n了 (CT\nAAA\n[ec See\n一 ote\n人\n强劲 的 功能 刚性 攻 丝 回 退 强劲 的 功能 高 速 刚 性 攻 丝\n在 攻 丝 加 工 意外 中 断后 可 通过 程序 指令 或 信号 激活 回 退 功能 刚性 攻 丝\n区 从 工作 中 出 eslasl\n车 前 加 工 车 削 加 工 车 削 加 工\nSee eee\nFane male\nsome\n(ayn\nwoe\n证 人 pon\nwud thes\n一 一 人 nul]\nmam\nees for\nlid axel im]\n车 削 加 工 磨 前 加 磨 削 加 工 安\n\n--- Page 7 ---\n25i 系 妨\nSSK25i 系 列 数控 系统 444\n量 技术 特点 技术 特点\n人 性 化 操作 界面 程序 管理 功能 人 性 化 操作 界面 多 台 系 统 运行 状态 远程 监控 /调试\n可 使 用 文件 夹 分 类 加 工程 序 使 查找 [ea lag: [Up [ae [fe gee 可 通过 网 络 进行 多 台数 控 系 统 的 监控 和 调试 实现 远程 监控 状态 在 线 修改 参数 等 功能\n程序 便捷 有 序\nioe mee\n人\n加 工 过 程 中 需要 执行 多 个 程序 才能 完成 一 一 一 上 可\n时 可 使 用 调度 功能 设 定 程序 运行 的 顺序 -一\nsae\n和 次 数 系 统 可 自动 按 设 定 完成 加 工 sos 站 人 Lore\nORFMEAREE 程序 调度 运行 功能 一 一\n米 [一\n人 性 化 操作 界面 FTP 数 据 服务 器 功能\n能 端 操 (LT\nIEF\n大 和 品\nGSK 25i 采 用 基于 TCP/IP 的 网 络 做 程序 传 wee 96838\njean 输 和 DNC 加 工 相 比 传统 的 RS232 接 口\n网 口传 输 更 方便 速 度 更 快 也 方便 组 建\n网 络\n全\nFTP 服务 器 设 定 FTP 服 务 器 操作\n人 性 化 操作 界面\n对 速度 电 流 加 速度 跟 随 误 差 攻 牙 (一\n同步 性 圆 度 误 差 等 图 形 通过 进行 显示\n分 析 辅 助 调试 简 化 调试 步骤\n人 性 化 操作 界面 多 级 权限 管理 功能\nois\nsame: [ee\n[一\n三\nee:\neee\n[cm||\neee See 多 级 权限 管理\n圆 度 误 差分 析 位 移 曲线 分 析\n\n--- Page 8 ---\nGSK 25i 系 列 数控 系统\nGSK 25iseries CNC system 444\n量 技术 特点 技术 特点\n强大 的 二 次 开 上 能 力 用 户 自 定义 功能 新 一 代 高 性 能 伺服 单元 配 高 动态 响应 系 列 伺服 单元\n用 户 可 使 用 编辑 软件 二 次 开发 系统 界面 实 现 如 下 功能 伺服 电机 采用 位 --25 位 高 分 辨 率 绝对 式 编码 器 显 著 提高 零件 加 工 精度\n实现 DXF 图 形 文件 导入 根 据 用 户 定义 的 后 处 理 自动 生成 代 码 绝对 式 编码 器 永久 免 维护 不 用 开机 回 零点\noat\n图 符 关联 信 号 、PLC 地 址 宏 变量 偏 置 图 片 等 实现 操作 数 据 输入 动 态 显示 等 功能 自动 识别 功能 误\n参数 自动 整定 功能 减 少 用 户 调试 时 间\none 机 械 振动 抑制 功能 检 测 机 械 共 振 点 频率 消 除 共振 振动 和 噪声\n222999\nNaveen\n新 一 代 高 性 能 伺服 单元\neee\nbad tare areas\n自 定义 界面 编辑 软件 自 定义 界面 DXF 图 形 文件 自动 生成 程序 功能 自 定义 界面 自动 生成 程序 后 处 理 设 定\nean ail\neS)\nwon foe’\nBagot foal Lit:\nfee sen is- mil\n和 本 pee\nmad\n串口 口 吕\n抑制 前 机 械 振动 抑制 后 机械 振 动 横 坐 标 -振动 频率 -振动 幅 值\n帮 |sxl een formes 新 一 代 高 性 能 伺服 单元\n自 定义 界面 关联 自 定义 界面 DXF 图 形 文 件 自动 生成 程序 功能 自 定义 界面 自动 生成 程序 后 处 理 设 定\n一\nhee! weet\n强大 的 二 次 开发 能 力 PLC 功 能 .一 二\nPLC 用 软件 功能 取代 了 继电器 控制 系统 中 大 量 的 中 间 继电器 时 间 继 电器 计 数 器 等 器 件 使 控制 柜 的 设计 安 装 接 线 工 作 量 大 大 减少 可 ape\n以 通过 修改 用 户 程序 方 便 快速 地 适应 工艺 条 件 的 变化 eee\n梯形 图 编程 多 PLC 程 序 选 择 存储 运 行程 序 可 选择\n基本 指令 处 理 时 间 RBH. 120008 窗口 功能 、PLC 轴 控制 功能 补偿 前 补偿 后\n基本 指令 :14 条 功 能 指令 ，52 条 通过 PLC 接 口 选择 加 工程 序 修 改 刀 补 和 坐标 系 什\nPLC， 修改 PLC 程 1024/1024， 可 立 :三 三 一\n开放 式 PLC， 可 在 系统 上 编辑 修改 PLC 程 序 1/O 点 最 大 可 扩展 至 1024/ 可 满足 大 型 复 杂 设 备 的 控制 新 一 代 高 性 能 伺服 单元 支持 直线 力 电机\n[Lv\nagree 零 传动 间隙 直接 驱动 具 有 速度 高 精 度 高 响 应 快 的 优势\nmor emt rene\nwna\n一\n本 有\n四\nwot tt) |b) |-o-\no_PLC 编 加 在 线 编辑 直线 电机 直 驱 力矩 电机\n\n--- Page 9 ---\nGSK\nGSK 25i series FSS 444\n中 技术 规格\n名 称 规 格 名 称 规 格\n轴 控 制 功 能 G27 返 回 参考 点 检查 G28 返 回 参考 点\n最 大 控制 轴 数 个 进 给 轴 加 个 伺服 主轴 G29 从 参考 点 返回 G30 返 回 第 参考 点\n轴 联 动 跳 过 功能 G31 跳 过 功能 用 于 刀具 和 工件 测量\n联动 轴\n轴 联 动 可 编程 控制 功能 可 编程 行程 极限 (G22、G23 可 编程 数据 输入 (G10)\nPLC 轴 控制 轴 数 最 多 轴 操作 功能 与 显示 功能\n进 给 轴 同 步 控制 最 多 组 运行 方式 选择 自动 、MDI、 编 辑 手 动 手 脉 回 零 、DNC\n全 闭环 控制 SSR 单 段 跳 段 机 床 锁 住 辅 助 功能 锁 选 择 停 空 运行 再 启动 急 停 超 程 释放 循 环 启动\n最 小 指令 单位 IS-B 0.001mm 0.0001inch 0.001° 开关 操作 进 给 保持 手 动 连续 进 给 单 步 进 给 快 速 进 给 刚 性 攻 丝 回 退 手 脉 主 轴 倍 率 进 给 倍率\n最 小 指令 单位 快速 倍率\n最 小 指令 单位 |S-C 0.0001mm 0.00001inch 0.0001°\n最 小 指令 单位 IS-B 0.001mm 0.0001inch 设 定 操作 刀具 长 度 补偿 测量 输入 工 件 偏 置 测量 输入 参 数 设 定 帮助 伺 服 参 数 设 定\n最 小 检\n令 单位 0.0001 0.00001inch 0.0001°\n最 小 指令 单位 程序 操作 M2. $8. HBR. LA. BR. SH. HO. 读 入 传 出 后 台 编 辑 动 态 图 形 仿真\n最 大 指令 值 +999999.9999mm 99999.9999inch 999999.9999°\n帮助 功能 报警 信息 解释 操 作 说 明 参 数 说 明 指令 说 明 代 码 指令 说 明 、PLC 地 址 说 明 计 算 器\n最 大 进 给 速度 最 大 进 给 速度 200m/min\n自动 加 减速 插 补 前 直线 曲 线 加 减速 加 加 速度 控制 英 寸 、10.4 英 寸 、8.4 英 寸 LCD 显 示 器 中 英文 显示 状 态 显 示 动 态 图 形 时 钟 加 工时\n高 速 高 精度 加 工 G05 高 速 小 线段 前 轨 迹 平滑 处 理 前 和 预 读 高 达 1000 段 显示 间 运 行 时 间 加 工件 数 模 态 信息 实 际 速度 硬 件 软件 版 本 梯 形 图 报 警 信息 诊 断 信\n息 报 警 属 历 操 作 历 显示\n五 轴 控 制 功 能\nRTCP 功 能 刀具 中 心 点 控制 G43.4 辅助 功能\n倾斜 面 加 工 五 轴 定位 (3+2) 加 工 G68.2 功 能 位 数 代码 多 代 码 指 令 代 码 调用 宏 程 序 子 程序\n五 轴 手 动 进 给 刀具 轴 向 刀 具 轴 直角 方向 刀 具 中 心 点 旋转 方向 手动 进 给\n功 能 位 数 刀 具 寿 命 管 理\n数字 主轴 模 拟 主轴 接口 10V 模 拟 电 压 输出 、S5 位 数 主 轴 速 度 指 定 多 主轴 控制 主 轴 定 向\n1SO 指 令 标准 程 序 名 0+4 位 数 段 号 N+5 位 数 G+3 位 数 坐 标 值 小 数 点 前 位 后 位 功 能\nTHAIS. ape. 丝 Rate!\n程序 格式 S+5 位 数 、T+3 位 、M+3 位 数 、F+ 小 数 点 前 位 后 位 型 型 换 挡 浮 动 攻 BUEN, SHER, SHR ROL\n揪 补 功能 定位 直 线 插 补 圆 播 补 螺 旋 插 补 圆 柱 面 补 极 坐标 样 条 曲线 插 补 精度 补偿 功能\n工件 坐标 系 基本 坐标 系 G52~G59、 附 加 扩展 坐标 系 (4G54.1) 组 反 向 间隙 补偿 快速 进 给 和 切削 进 给 分 开 补偿\n刀具 补偿 补 功能 、400 组 刀具 补偿 螺 距 补偿 揪 补 型 单 向 双 向 螺 距 误差 补偿\n共 100 多 个 令 包 括 种 常用 固定 循环 、19 种 特殊 固定 循环 和 复合 循环 面 坐 标 系 旋 转 比 通信 和 数据 输入 输出 接口 功能\n编程 功能 例 缩放 镜 像 刀 有 具 长 度 自动 测量 刀 具 中 心 点 控制 倾 斜面 加 工 子 程序 调用 级 数 为 级 类 数据 接口 功能 后 置 以 太 网 前 置 USB 接 口 通 过 接口 可 实现 数据 传输 、DNC 和 网 络 功能\n用 户 宏 程序\n数据 输入 /输出 程序 、NC 参 数 补 偿 值 偏 置 值 宏 变量 值 、PLC 程 序 、PLC 参 数 通 过 数据 接口 输入 输出 可\n程序 存储 程序 存储 容量 为 以 上 程 序 存储 数量 为 400 个 通过 以 太 网 、USB 接 口 DNC\n\n--- Page 10 ---\nGSK 25i 系 列 数控 系统\nGSK 25iseries CNC system 441\n名 称 规 格 主\n网 络 功能 以 太 网 通信 网 络 DNC、 远 程 监控 远 程 诊断 远 程 维 护 GSK25iMc (模式 8.4 寸 屏 独 立 按键 主 机 面板 安装 尺寸\nIOR-04T 接 线 端 子 式 48/32\nIOR-44T 接 线 端子 式 模拟 48/32 AO: 488, 10V\n接口 IDR-21F 排 线 插 接 式 “DVDO: 24/16 AO: 路 ，0~ 10V\nIOR-44F 排 线 插 接 式 模 拟 DI/DO: 48/32 AO: 41%, 0~10V\n最 大 扩展 点 数 1024 点 /1024 点\n伺服 驱动 接口 GSK-Link 以 太 网 总 线 接 口 Bae\n{ts\n一\n全 闭环 接口 一\n适 配 增 于 光栅 尺 角 度 编码 器 ，TTL 方 波 信号\neet\nteal 030 Dif\naco\n程序 扫描 周期 2~8ms， 基 本 指令 执行 时 间 0.1us/ 步 最 大 程序 步 数 12000 步 梯 形 图 可 在 线 动态\n中 间 继 电器 (R) 1100 字 节 (RO 到 R1099\n数据 寄存 器 (D) 1860 字 节 (D0 到 D1859\nPLC 规 格 计数 器 (C) 400 个 字 节 到 C399 100 个 GSK 25iMc 横 式 8.4 寸 屏 独立 按键 操 作 面 板 安装 尺寸\n定时 器 (T) 200 个 字 节 到 T199 100 个\n信息 显示 请 求 信号 (A) 字 节 (A0 到 二 一 二\n保持 型 继电器 (K) 字 节 (K0 到 K31) =--—j fet int\nfella 一\n跳 转 标号 (L) 9999 (L1~L9999 SUS 一\n子 程序 标号 (P) 512 (P1~P512) 到 人\n安全 与 维护 功能\n紧急 停止 硬 限 位 第 一 软 限 位 第 一 软 限 位 Il, BOI, SHAME, 天 天\n度 进 给 安全 速度 、NC 报 警 ，PLC 报 警 伺 服 报警 跟 随 误差 监控 伺 服 断 开 互 锁\n安装 开 孔 加 工 图\n操作 历 报 警 历 加 工 历 、CNC 运 行 状 态 诊断 、PLC 接 口 诊断 、CNC 和 PLC 数 据 备份 恢 一 十 十 十\n复 度 波形 诊断 网 络 诊断 维护 伺 服 设置 与 伺服 负载 及 状态 监视 诊 断 图 TTT\ncc.\n“TM TUT 证\n\n--- Page 11 ---\nWis\nsami\n系统 外 形 安 装 尺 十\nGSK 25iMc 10.4 寸 屏 独立 按键 主 机 面板 安装 尺寸 GSK 25iMc 横 式 10.4 寸 屏 面膜 主 机 面板 安装 尺寸\n2150\neee 和\nerally\n口 回回 加 回回 乡 [6.9]\nfoal aie\n用 出 用 用\n村 一\n4602 安装 开 可 工 图\nlit\n一 一 二\n二\n468+0.25\nGSK 25iMc 横 式 10.4 寸 屏 独立 按键) 操作 面板 安装 尺寸 GSK 25iMc 横 式 10.4 寸 屏 面膜 操 作 面板 安装 尺寸\n150\naes:\n出\nBee el!\n一 Ye.\none ily\n四 后 ye) BER 将\nSHES oar ote\n45921\n乡\nnin aie 安装 开 孔 加 工 图 8_o5\nLass\n由 一 一 un| le)\n一 一\nyoo\n468+0.25\n\n--- Page 12 ---\nGSK 25i 系 列 数控 系统\nGSR sax\nGSK 25iMc 坚 式 10.4 寸 屏 独 立 按键 主 机 面板 安装 尺寸 GSK 25iMc 竖 式 10.4 寸 屏 面膜 主 机 面板 安装 尺寸\n安装 开 孔 加 工 图 安装 开 孔 加 工 图\n站\nAl}\n六\n日\nSly 一\n中\n四\n回回 图 回回 回 国 国 图 图\n回回 回 国 sow PIMC)\n回回 回 国 O00 国 回回 四 图 国外\nOOO) 国 eee ce)\nWise 图 Ce}\nGSK 25iMc 式 10.4 寸 屏 独 立 按键 操 作 面 板 安 装 尺寸 GSK 25iMc 坚 式 10.4 寸 屏 面膜 操 作 面板 安装 尺 才\n安装 开 孔 加 工 图\n一 一 一\n上 二 -一 -一作 一 -一 一 一 他 一\nfie\nlalate siete) eal\nUFO CECH alates\ncoy\ngot 一\noem 一 一\nRBOtO\n\n--- Page 13 ---\n安装 尺寸\n五 轴 联 动 应 用\nGSK 25iMc 坚 式 寸 屏 主 机 面板 安装 尺寸 GSK 石 轴 联 动 系统 针对 由 自由 曲面 空 间 特征 等 构成 的 复杂 零件 提 供 RTCP 功 能 保证 刀 尖 点 及 刀 轴 矢量 的 精确 控制 可 有 效\n避免 过 切 和 欠 切 配 合 前 瞻 速 度 平滑 处 理 功能 可 根据 刀具 路 径 几何 特性 如 尖 角 大 曲率 区 域 刀 轴 摆 动 剧 烈 等 提 前 自动 计\n安装 开 孔 加 工 图 算 合 适 的 衔接 速度 实 现 自 适 应 的 加 减速 平滑 控制 可 在 保证 加 工 质量 的 基础 上 获得 最 优 的 加 工效 率 适 用 于 航空 航 天 船 舶\n一 一 能 源 汽 车 等 制造 行业 的 多 轴 的 定位 及 联动 加 工 应 用\n口\nfy,\n月 acre\nzy,\nive\n人 ite\ntite,\n————\n11.5\n于\n上 一\n一 轴 轴 联动 轴 轴 联动 轴 轴 联动\nZ1、Z2 轴 和 A1、A2 轴 两 组 同步 双 驱 tat 轴 择 篮 式 结构\nGSK 25iMc 竖 式 寸 屏 操 作 面板 安装 尺寸 其 中 A1、A2 轴 为 力矩 电机 Y1、Y2 轴 同步 双 驱 Y1、Y2 轴 同步 双 驱\n54Kw 电 主轴 全 闭环 控制 伞 型 刀 库\n安装 开 加 工 图 把 伺服 刀 库 伺服 刀 库 工作 台 直 径 400\n四 O00 适合 加 工 航空 发 动机 汽轮机 叶片 工作 台 直 径 400 适合 加 工 叶轮 叶 盘 箱 体 及 模具\nBEE 蝇 天 适合 加 工 叶轮 /时 盘 箱 体 及 模具\nSSO me}\n月\nttt ty, 人\n|/4\n2280 3.4\nChi\ntool\nRo! 一\n\n--- Page 14 ---\n25i 系 到\nSSK25i 系 列 数控 系统 444\nFAS Bil 应 用 有 条例\nHBC-U150 五 轴 加 工 中 心 VMC-B50C 五 轴 加 工 中 心 DMU (改造 五 轴 专 机 应 用\nTG55-CN 工 PG55-CNC 五 空 仿 形 ED54-CNC 五 电 火 花 机\n动 联动 G55-CNC 五 轴 工 具 磨床 轴 数 控 仿 形 SET} tet\n斗 等 刀 库 混合 式 结构 非 正 交 双 转 台 结构\n工作 台 直径 150 ARIE 全 闭环 控制 to.\n24000 转 电 主轴 工作 台 直 径 500 工作 台 直 径 630MM\n适合 加 工 小 型 叶轮 人 工 骨 关节 牙齿/ 24000 转 电 主轴 轴 摆动 范围 -5~+110 度\n模具 工艺 品 竺 适合 加 工 盘 类 复杂 零件 箱 体 模 适合 加 工 各 种 多 面体 零件 及 模具\n轮胎 模 竺\n-一 一\ntee,\n一 一\nTG55-CNC 采 用 了 本 行业 中 最 先进 的 五 PG55-CNC 用 于 加 工 硬 质 合 金 木工 成 型 ED54-CNC 床 身 采 用 了 成 结构 的 龙门\nMUST. 7). CAD 650 铸 件 床 身 具 有 结构 刚性 好 床 身 精 度\n配置 专门 刀具 磨 软件 包 可 配置 自动 上 下 料 图 纸 编程 代 蔡 传 统 的 人 工 操作 仿 形 磨床 加 工 高 变 形 小 的 特点 采 用 了 轴 联 动 控制 技\n系统 磨 软件 带 有 及 演 示 功 能 可 存储 TR: 减轻 了 工人 劳动 强度 ;加 工 环境 污染 得 术 控 制 灵 活 机 行程 大 可 加 工 刀 有 具 品种\n数 百 种 刀具 参数 模型 方 便 用 户 多 种 类 生产 到 了 有 效 的 控制 ;加 工 精度 高 目 稳定 避 免 人 丰富\n五 轴 加 工 产品 展示 采用 刀具 制造 专用 数控 系统 方 便 用 户 多 ART.\n种 类 生产\n一 了 人 磨 头 回转 轴 采用 进口 旋转 工作 台 确 保\n‘ine 高 精度 高 稳定 性\nene\n磨 头 主轴 配备 独立 的 油 冷却 机\n航空 发 动机 汽轮机 叶片\n五 轴 专 机 加 工 产 品 展示\n人\neee ae” —_—\neer 二\n“4.”\note\n增 压 器 叶轮 增 压 器 叶轮 钻头 钻头 Yeh\neee\nye” “fr wh;\nwel\n镜面 加 工 口罩 机 熔接 具 模\n\n--- Page 15 ---\nGSK 25i 系 列 数 控 系 统 GSK 218MC/GSK 208D/GSK 990MC 铣 床 加 工 中 心 数控 系统\nGSK 25i series CNC system GSK 218MC/GSK 208D/GSK 990MC milling machine machining Center CNC system\n产品 概述\n典型 配套 机 床 应 用 GSK 218MC/GSK 208D/GSK 990MC 铣 床 加 工 中心 数 控 系 统\neee een\nGSK 218MC 系 列 简单 描述 eae\n二 标准 的 五 轴 五 联动 加 工 中 心\n二 8.4 英 寸 10.4 英 十\n有 专用 版 本 支持 轴 联 动\nOnn 色\nvue 特\n一 全 一\n立 式 加 工 中心 高 速 立 式 加 工 中 心 卧 式 加 工 中 心 高 速 高 精 复 杂 曲 面 加 工 有 效 速度 8m/min, 最 佳 加 工 速度 4m/min;\n有 前 瞻 功 能 插 补 预 处 理 段 数 高 达 1000 段 最 高 定位 速度 60mjmin，\n665 ene BARE 1Sm/min;\n支持 Rs232，USB，RJ45 三 种 通讯 接口 实 现 文件 传输 、DNC 加\n一 于\n斗 竺 式 国 盘 式 服 刀 库 等 多 种 刀 库\n支持 GsK-Link 以 太 网 总 线 功能 (GE 和 系 列 支 持 位 绝对 式 编\n码 器 实现 全 闭环 控制 亦 可 选 配 力矩 电机 电 主轴 ;系统 具备 路\n和 ney GSK 218MC-V GSK218MC-H GSK 218MC 主轴 模拟 电压 和 组 PMC 轴\n一 一 en, 可 适 配 自动 分 中 仪器 可 适 配 自动 对 刀 仪 功能\n龙门 加 工 中 心 钻 攻 中 心 USHER GSK 208D 系 列 简单 描述 显示 屏\n磨 削 机 床 应 用 复合 加 工 应 用 8.4380 10.4380\n在 同一 系统 内 通过 的 代 码 可 实现 铣削 和 车 削 系 统 的 自由 切换\nfoe 自动 对 能\nees\n二 100088:\n支持 PLC 在 线 监视 编 辑 编 译 信 号 跟踪 功能\n二 一 一\nmus cava 支持 GSK-Link 以 太 网 总 线 功能 支 持 绝对 式 电机\nnunc\n‘@) 支持 双 驱 调节 功能\n“RE ORE\nCO.\nGSK 208D-V GSK 208D-H\n导轨 床 车 削 系统\nGSK 990MC 简单 描述\n一 .一 人\n一 于 aan 针对 经 济 型 钻 铣 数控 机 床\n特 色\n一\ntele celia 开放 式 PLC 支 持 在 线 监控 编辑\nSHULER,\nGSK-Link& ae,\n外 工 支持 GSK-Link 总 线 功能 连 接 方便 扩 展 性 强 支 持 绝对 式 电机\n\n--- Page 16 ---\nGSK ZISMCIGSK\n产品 概述\natt\nGSK 218MC-H2 简单 描述 总 线 配置\n针对 异型 螺杆 机 床 10.4 英 寸\n了 SEE 取代 过 去 脉冲 控制 介质 通过 总 线 的 运动 控制 插 补 时 间 大 幅 缩短 运 动 平顺 性 大 幅 提升 支 持 GSK- Link 总 线\n特 色 适 配 GR/GE 驱 动 器 和 GL200-F 实 现 所 有 进 给 轴 主 轴 、VO 单 元 总 线 连接 且 可 以 实现 总 线 型 驱动 器 与 脉冲 型 驱动 器 混合 连接 使 用\n适 配 GR/GE 驱 动 器 在 CNC 中 即 可 实现 在 线 伺服 参数 查看 设 置 备 份 还 原 恢 复 默认 值\n增加 G07 抛 物 线 旋 插 补 指令 、G01 螺 旋 插 补 指令 可 根据 螺杆 要\n求 指定 中 变 大 变 小 变 深 变 等 加 工 功能\n增加 手 轮 中 断 示 教 功能 用 户 可 操作 手 轮 倍 率 及 速度 快慢 握手 轮\nrooe. 验证 程序 正确 性 在 加 工 过 程 中 实时 调整 刀具 位 置 状 态 ibe)\n[aero\nous.) onus cey\n技术 特点 jefe fen\nSees\n个\n对 lol\n系统 连接 图 中 (6L200-2J45) 时 请 设置 从 机 号 为 100， 取 里 号 为\n全 新 升级 主板 ，CPU 性 能 提升 20%， 内 存 增加 倍 存 储 置\n和\n扩大 到 216M， 预 留 卡 存储 扩展 实 现 RJ45 接 口 总 线 连 (10 Unit) (GR Servo) (GR Servo) (GR Servo)\n接 采 用 高 速 样 条 插 补 算法 218/208)， 加 工 速度 精 度 218MC 系 列 、208D 系 列 、990MC、218MC-H2 连 接 方法 相同\n表面 光洁 度 得 到 大 幅 提升\n高 速 高 精 复 杂 曲 面 加 工 有 效 速 度 8m/min, 最 佳 加 工 速度\n4m/min 953585 aay,\n最 高 定位 速度 60mjmin， 最 高 进 给 速度 15mimin 模具 高 速 高 精 加 工\n具有 前 功 能 揪 补 预 处 理 段 数 高 达 1000 段 速 度 快 精\n908 srr\n度 高 光 洁 度 好 .nr 采用 高 速 插 补 技术 复 杂 曲 面 如 工 有 效 速 度 最 佳 加 工 速 度 预 处 理 段 数 高 达 1000 段 具 有 前 功 能 速 度 快 精 度 高\n刚性 攻 丝 跟 随 误差 诊断 界面 以 及 波形 显示 界面 简 洁 方便 的 CO) 光洁 度 好\n刚性 攻 丝 调试 方式 根据 指令 路 径 对 形状 作 全 局 判断 若 含有 微小 线段 差 的 情况 下 也 可 以 避免 不 必要 的 减速 确 保 无 偏差 的 平滑 加 工 面\n支持 PLC 在 线 编辑 编 译 信 号 跟踪 功能 扩大 PLC 的 程序 ”wo 加 工时 间 比 以 往 缩短 5-30% 而 且 进 给 速度 越 高 效 越 明显\n容量 高 达 15000 步\n具备 电子 齿轮 箱 (EGB 功能 了\n齿轮 加 工 自 适应 误差 补偿 相位 同步 功能\nfh, aan\n双 驱 同步 轴 及 平行 轴 功 能\n切削 进 给 法 向 控制 进 给 伺服 进 给 伺服 进 给 伺服 主轴 伺服\n支持 RS232、USB、RJ45 三 种 通信 接口 实 现 文件 传输\nDNC 加 工 ，USB 在 线 加 工 Aen\n的 cog\n支持 GSK-LINK 以 太 网 总 线 功 能 (GE 和 系 列 连 接 广 一 二\n便 扩 展 性 强 支 持 位 绝对 式 编码 器 精 度 高 免 回 零\n可 实现 全 闭环 控制 选 配 亦 可 选 配 力矩 电机 电 主轴\n系统 具备 路 主轴 模拟 电压 和 组 PMC 轴 wwe\nC3)\n一\n轴 电机 轴 电机 轴 电机 轴 电机 主轴 电机\n齿轮 蜂窝 玫瑰 花 五 指 山\n\n--- Page 17 ---\nGSK 2080/GSK\n技术 特点 中 技术 特点\n刚性 攻 丝 回 退 功能 刚性 攻 丝 波形 诊断 自动 对 刀 功 能\n在 攻 丝 过 程 中 由 于 工件 装 来 精度 或 者 加 工程 序 编写 等 原因 断 锥 现象 是 比较 常见 的 再 者 简化 刚性 攻 丝 调试 流程 操作 对 万 功能 包括 两 部分， 刀具 长 度 测量 和 原点 设 定\n各 已 党 位 itty 示 位 Nisan 丝\naun 刀具 测量 刀具 长 度 测量 是 通过 安装 在 工作 台 上 的 对 刀 仪 来 对 不 同 刀 具 进行 度 测量 和 直 mee\n工作 量 并 将 各 刀具 的 长 度 和 直径 定 至 指定 的 刀具 信和 器 中 以 此 来 下 运行\n同一 程序 时 即使 使 用 不 同 长 度 及 直径 的 刀具 也 能 正确 的 进行 加 工 一\n让 轴 工件 原点 设 定 在 完成 了 刀具 长 度 测量 之 后 移 动 刀具 到 工件 表面 此 时 可 按 测\n软 键 将 当前 机 床 坐 标 值 作为 原点 设 定 到 所 选 定 的 工件 坐标 系 (G54~G59 G54 P1~P50)\n当中 iu” (30)\n一\n‘RS:\n———\n攻\n中 断 点 刚性 攻 丝 回 退 起 点\nomni 双 驱 同步 及 平行 轴 功 能\n分 期 付款 功能 PLC 信 号 采样 功能 双 驱 同步 功能 age 到 人\n一 个 轴 指 人 实现 双\n完善 的 分 期 付款 功能 实 现 了 在 系统 上 解除 限时 停机 时 间 和 端 软件 远程 解除 延迟 限时 停 “方便 直接 的 监控 界面 传动 sr\" ete\n机 时 间 X、Y、F、G 信 号 均 能 检测 ne,\n当 停 机 密码 为 初始 密码 系 统 会 在 输入 栏 上 方 提示 判断 外 部 信号 是 否 正常 即 便 是 几 毫 秒 的 差 进 行 同步 误差 补偿\n接触 不 良 闪 动 ”信号 也 能 诊断 平行 轴 功 能\n个 可 三 一 一\n可 设置 个 或 多 个 控制 轴 作 为 相同 与 基本\nOIE SERS BARA\n一 过 暂时 基本 轴 控制 进行 切削\nners\nsone\nom: 年 用 ”eu 日\nLee\nem) (3) kth\n入\n电子 齿轮 箱 功能 (ECB)\n自 定义 界面 滚 齿 机 加 工 齿轮 时 需 保证 工件 轴 与 滚 刀\n按照 一 定 的 比率 进行 旋转 电 子 齿轮 箱 wes\nEGB 功能 使 与 伺服 电动 机 相 联 的 ene ee]\n多 自 定义 界面 选择 Max.8 个 开放 性 参数 设置 铀 的 旋转 与 同 主轴 电动 机 相 联 的 刀具 轴 TMM\n提供 大 的 开放 参数 每 个 界面 最 多 可 使 用 个 变量 参数 GARI) 的 旋转 同步 同 步 的 比率 可 通过\nfect 000\n用 户 自 定义 每 个 参数 的 功能 注 Af)\n42>: oes 分 RHC arn 安全 位 置 ?7P ?93 了 wae 一\n可 根据 功能 特性 自 行 添加 图 片 介绍 vat DCs\n参数 在 确认 后 才 生 效 更 好 的 确保 参数 设置 的 正确 性 方 便 的 功能 编辑 随 刀 具 轴 的 速度 变动 可 以 实现 高 精度 的 ”PR\n六“ 895\n采用 便捷 的 功 能 指令 编辑 功能 程序 齿轮 加 工\nmie “en\nRAG, MASALA 区\nrer\n\n--- Page 18 ---\n必\nGSK\nLass 技术 特点\n齿轮 加 工 自 适应 误差 补偿 相位 同步 功能 车 间 管 理应 用\n自 适应 相位 误差 补偿 可 通过 网 络 接口 接 入 局 域 网 实 现在 电\n对 双 电机 的 同步 控制 进行 同步 优化 控制 采 用 自 适应 算法 进行 相位 误差 补偿 使 其 快速 脑 端 管理 多 台 系 统\n到 达 相 位 同步 从 而 实现 电机 或 机 械 高 精度 同步 控制 hes 加 减少 操作 人 员 提 高 车 间 管 理 效率\nar:\n加 工 应 用 Won!\n在 齿轮 加 工 中 滚 刀 与 工件 一 直 处 于 同步 状态 当 断 电 重启 后 需 重复 加 工时 由 于 产生 Hes\nvee\n相位 同步 自 适应 误差 补偿 功能 在 齿轮 加 工 中 从 而 实现 断 电 重复 加 工 We”\n从\nkey” 一\n技术 规格\n滚 齿 原理 进 给 驱动 器 主 轴 扩 展 光栅 尺 推荐 备 注\nGSK 218MC\n切削 进 给 法 向 控制 广 数 绝 对 式 光栅 尺 ate\nGSK 208D 广 数 绝对 式 变频 主轴 RHR 驱 动 器 处 理\n广 数 系 列 低 主 村 光栅 尺 数 据\n切削 法 线 方 向 控制 GSK 990MC\n切削 过 程 中 有 旋转 轴 的 刀具 在 平 面 上 移动 时 法 线 方向 控制 功能 可 以 控制 旋转 轴 从\n而 达到 刀具 始终 朝 着 与 刀具 垂直 的 方向 移动\n主要 应 用 于 具备 旋转 功能 的 加 工 刀 具 切 削 时 由 于 形状 的 改变 导致 刀具 与 切削 面 不 垂直 引 MJB 输 入 板 MJB 板 尺寸 图\n起 的 过 切 现象 使 用 法 线 方向 控制 可 避免 该 现象 的 发 生 ONS\n一\n180\nMJB 输 出 板\n基 于 数 控 系 统 的 架 通 道 控 bil 下 了\n“eee FET\nGRA GAY\n控制 采用 PMC 轴 控制 功 能 通过 PLC 进 行 实现\n利用 梅 架 功能 可 实现 自动 上 下 料 节 省 设备 成 本\nRELL MJB 输 出 板 带 继电器 由\ntase.’ nas 一\nase. bor\nLand “ee\n0069\n_25\n\n--- Page 19 ---\nGSK 2080/GSK\n系 统 GSK 218MC GSK 208D GSK 990MC GSK 218MC-H2 系统 外 形 尺寸\n屏幕 8.4/10.4 8.4/10.4 8.4 10.4 GSK 218MC-V 坚 式 10.4 寸 屏 面膜 按键 主机 面板 安装 尺寸\nBARE\n联动 轴 数 eee\n人\nPMC 轴 数\n最 大 主轴 数\n(a3) 1/O 数 48/48 48/48 48/48 48/48 (38)\n坐标 系\n中\nPLC 可 在 线 编辑 可 在 线 编辑 可 在 线 编辑 可 在 线 编辑\nGSK-Link 总 线 标准 标准 标准 标准\nlia eek\n高 精 高 有 有 无 有 (Gee)\n圆柱 插 有 有 有 有\n对 万 功能 有 有 有 有\n双向 螺 补 有 有 有 有\n分 开 式 间隙 补偿 有 有 有 有\nGSK 218MC-V 式 10.4 寸 屏 面膜 按键 操作 面板 安装 尺寸\n刚性 攻 丝 有 无 有 有\n刀 库 有 可 扩展 可 扩展 可 扩展 10. 用 户 开 孔 安 装 尺寸 图\n自 定义 界面 有 有 有 有 一\n光栅 尺 功 支持 支持 支持 支持 Aaa\n网 络 通读 支持 支持 不 支持 支持\n手 轮 模拟 双向 双向 双向\n四\nmyo\n有\n>150\n\n--- Page 20 ---\nGSK 218MC/GSK 208D/GSK 990MC 床 加 工 中 心 数控 系统\nGSK 218MC/GSK 208D/GSK 990MC milling machine machining Center CNC system 厂 一 控\n安装 尺寸 GRRT\n系统 外 形 安装 尺寸\nGSK 218MC-H 横 式 8.4 寸 屏 面膜 按键 主机 面板 安装 尺寸 GSK 218MC 横 式 10.4 寸 屏 面膜 按键 主机 面板 安装 尺 十\n390\neal el)\nsee\nlt.\nEco COM\nie!\n383 8.75 bese lets,\n四\n用 户 开 安装 尺寸 图 用 户 安装 加 工 图\n130+0.15 13040.15 130=0.15\nees]\nGSK 218MC-H 竖 式 8.4 寸 屏 面膜 按键 操作 面板 安装 尺寸 GSK 990MC 横 式 8.4 寸 屏 面 膜 按 键 主机 面板 安装 尺寸\n8-07 8-94 _—_\n多\neae cae 乡\n国 回国 国 加 四 加 四 外\n10.28 Soe cal\n用 户 开 孔 安装 尺寸 图\n4-875 504015, 1302015. 13080. [bi\n人 用 户 安装 加\nLS。|S 了 了 了 了\nsaat\"\n\n--- Page 21 ---\nGSK 218MC/GSK 208D/GSK 990MC 床 中 心 数 控 系 统\nGSK 218MC/GSK 208D/GSK 990MC milling machine machining Center CNC system 厂 一 444\n上 安装 尺寸 安装\n系统 外 形 尺 十\nGSK 218MC-H2 横 式 10.4 寸 屏 面膜 按键 主机 面板 安装 尺寸 GSK 208D-V 坚 式 10.4 寸 屏 面膜 按键 主机 面板 安装 尺寸\nM6.\nNEA\n回\n有\n用 户 开 孔 安 装 尺 寸 图 (SWE) 口\nesl\nGSK 218MC-H2 横 式 10.4 寸 屏 面膜 按键 操作 面板 安装 尺寸 GSK 208D-V 坚 式 10.4 寸 屏 面膜 按键 操作 面板 安装 尺寸\n一 一\nSTS) .——— ———\nmene\nfon\nPon\n25H\n280+0.15\nSSeS yap\n\n--- Page 22 ---\n必 GSK 208D-H 横 式 8.4 寸 屏 面膜 操作 面板 安装 尺寸 cere yar et: Fat. 人 用 户 开 孔 安装 太 寸 图 麻 具 加 工\nFa, 和 加 130t01 130t01 130t0.1 内\nime res 本 人 -一\n系统 外 形 安 装 25.\nGSK 208D-H 横 式 8.4 寸 屏 面膜 按键 主机 面板 安装 尺寸 精 加 工时 间 分 钟 秒\n390 有 一 人\n[oot\n一 一 一\nPas\n引\n383 8.75\nELE\nnih Seal\n用 户 开 孔 安 装 尺寸 图\n130t0.15 130t015 13020.15 Sop “Ss\n“73 aay eee\nare\n一 一 一\ntus\nPin, sig “male\n一 一 一\n\n--- Page 23 ---\n必\nGSK 218MCIGSK 208D/GSK HOME SSSR\n应 用 案例 应 用 案例\nGSK RUB\nree 全 站 可 实现 五 轴 五 联动 和 八 轴 五 联动\n实现 适合 加 工 圆 柄 类 工具 如 整体 铣 刀\nTDR, ALIA, BLA, tht, 四 及\nthin, 刀 等 孔 加 工 刀具 的 软件 版 本 a...\nsee\n下\nerrr\n和\nAAA 月 RN,\nFSO\n成 品 实 拍 图 成 品 实 拍 图\nace 一\nGSK 218MC 数 控 系 统 在 重庆 机 床 集团 有 限 责任 公司 滚 齿 机 上 的 应 用\nofS 锥 度 齿轮 鼓 形 齿轮 少 齿 数 齿轮 及 花 键\n-一 为 用 户 提供 了 一 个 参数 化 的 操作 界面 用 户 根据 工件 情况 可 以 Mis\n选择 圆柱 直 齿 轮 斜 齿轮 小 锥 度 齿轮 鼓 形 齿 轮 的 加 工程\ncra 序 输 入 刀具 参数 工 件 参数 工 艺 参数 和 进 给 次 数 系 统 将\n自动 生成 加 工程 序 不 需要 任何 编程 指令\n驱动 采 用 专用 滚 齿 指令 实 现 联动 滚 齿轮 通 过 简单 的 编程 ee,\nROME: 一\n按 数控 滚 齿 机 精度 Q/CB0053-2000 规 范 机 床 作 精 加 工 精度 加 工 机 床 实 拍 图\n一 一 本\nAAA 可 达 GB10095 一 2001 齿 轮 精 度 标 准 的 6-7 级\n断 电 重启 后 能 运行 上 一 次 已 完成 的 加 工程 序\n电 上 电 后 继续 精 修 加 工\n一 ..4 急 停 和 报警 急 退 保护 功能 Ses\nf7rd wel 自动 对 齿 功能 Ay,\nees\n和 rae\nnes\n0A, ty:\n加 工 工件 成 品\n\n--- Page 24 ---\nGSK 218MC/GSK 208D/GSK 990MC 铣 床 加 工 中 心 数 控 系 统 GSK 988MA 系列 铣床 加 工 中 心 数 控 系统\nGSK 218MC/GSK 208D/GSK 990MC milling machine machining Center CNC system GSK 988MA series milling machine machining center CNC system\nGSK 218MC 在 异型 螺杆 铣床 上 的 改造 应 用 GSK 988MA 系 列 加 工 中 心 数控 系统\n系统 控制 轴 数 轴 GSK 988MA 系 列 数控 系统 为 铣削 加 工 中 心 数控 系统 基 于 双核 硬件 架构 支 持 自主 知识 产权 的 GSK-Link 工 业 以 太 网 总 线 与 伺服\n实现 抛物 线 螺旋 插 补 指令\n令 二 驱动 单元 及 单元 相连 也 支持 EtherCAT 总 线 适 配 标准 CoE 接 口 伺服 和 单元 支 持 速度 前 瞻 (look-ahead) 技术 高 次 样 条 拟\n实现 G01 螺 旋 插 补 指令 合 技术 支 持 儿 复合 加 工 支 持 蓝图 编程 功能 编 程 引导 功能 支 持 完善 的 工艺 帮助 支 持 远程 监控 等 能 满足 加 工 中 心 应 用 及 模具\n实现 手 轮 中 断 加 工 应 用 要 求\n实现 手 轮 示 教 anne\nlly 产品 配置 GSK 988MA 系 列 铣床 加 工 中 心 系统 根据 结构 尺寸 分 为 8.4 寸 和 10.4 寸 两 种 液晶 屏 系统 都 支持 ook-ahead、 样 条 拟\n合 技术 能 满足 高 速 小 线段 模具 加 工 要 求\n加 工 机 床 实 拍 图 成 品 齿轮 实 拍 图 系统 配置 进 给 轴 OEM. 轴 oCs 轴 个 ol0 单 元 个 编码 器 接口 路\nOF: OLCD:8.4° TFT 10.4° TET\n43.241 150 ver 212 ase aoe\n202. 一\n“Sa eee Bae\nnee sos\n手 轮 中 断 界面 age\nawe\nnag Get\nGSK 218MC, GSK 990MC 数 控 系 统 在 阳江 磨 刀 机 床上 的 改造 应 用\n系统 控制 轴 数 轴 砂 带 机 为 轴 ry) GSK988MA 横 式 8.4 GSK 988MA 横 式 10.4” GSK988MA 坚 式 10.4\n实现 磨 刀 机 工序 编辑 功能\n实现 DXF 图 纸 导 入 CNC 生 成 加 工程 序\n实现 自动 修 砂轮 功能 磨 刀 轨 迹 的 分 自\n补偿 ABs. BANS\n加 工 机 床 实 拍 图\n插 补 周期 ，1ms; 支持 自动 化 生产 线 的 无 接 入， 支持 远 支持 斗笠 圆 盘 式 等 多 种 刀 库\nfine 最 高 速度 ，100my/min 0.1um 精 度 时 监控 功能 支持 语句 式 宏 程序 编 程 更 加 简洁\n一 日\n支持 look-ahead 前 瞻 控 制 技术 支持 USB， 网 络 三 种 通讯 接口 实 现 文 提供 系统 调试 功能 方 便 机 床 装配 调试\n支持 高 次 样 条 拟 合 技术 件 传输 、DNC 加 工 ，USB 在 线 加 工 支持 在 线 伺服 参数 修改 支 持 刚 性 攻 丝\n支持 丰富 的 复合 轨迹 循环 指令 支 持 蓝 支持 GSK-LINK 以 太 网 总 线 也 可 支持 功能 调试 具 备 示波器 功能 能 直观 的\n图 编程 支 持 编程 引导 及 工艺 帮助 EthterCAT 总 线 支 持 位 绝对 式 编码 分 析 位 置 /速度 特性 曲线 贺 度 曲线 能\n支持 多 主轴 控制 器 精 度 高 免 回 零 记录 插 补 运动 误差 数据 文件\n支持 进 给 轴 同 步 支持 PLC 在 线 编辑 编 译\n专用 界面 成 品 刀具 实 拍 图\n\n--- Page 25 ---\n量 技术 特点 技术 特点\n进 给 伺服 驱动 装置 主轴 人 服 驱动 装置\nGSK 988MA 系 列 产品 配套 GR2000-L 系列 总 线 式 伺服 驱动 单 988MA 系 列 产品 配套 GR3000-L 系列 总 线 式 主轴 伺服 驱动\n元 配 套 的 伺服 电机 采用 多 圈 位 绝对 式 编码 器 支持 磁 阻 编码 器 栅 码 器 的 接 入 可 实现 高 精度 轴\nGS2000 HER rms\n标 配 GR3000-L 系 列 总 线 主轴 驱动 单元 医 的 接 入 ,可 实现 高 精度 位 置 控制 控制\n可 配 磁 阻 编码 器 磁 栅 实 现 高 精度 轴\nmI. _——— 上 bag “BL\n最 多 扩展 个 单元 从 站 设备 输 入 /输出 有\n有\nLis\n缝 连接， 构建 自动 化 生产 线 ABE ind\nGSK g88MA 列 数控 系统 采用 GS3000 (系列 二 GSK 988MA 系 列 产品 采用 分 离 式 操作 面板 独 立 式 按键 结构 具 有 横 式 坚 式 、8.4 寸 屏 /10.4 寸 屏 等 装配 方式 适 合 多 种 安装 布局\n工业 以 太 网 总 线 控制 连接 从 站 设备 也 支 GSK 988MA 系 列 产品 的 电气 接口 基本 都 集中 在 主机 单元 及 操作 面板 上 横 式 结构 竖 式 结构 、8.4 寸 屏 /10.4 寸 屏 的 电气 接口 相同\n持 总 线 让 GSK-Link 接 口 连接 从 站 以 太 网 接口 主机 通讯 接口 外 置 手持 接 品\n主机 后 置 端 口 快速 输入 接口 连接 面板 通讯 接口 机 床 操作 面板 后 置 机 床 接口 机 床 附加 面板 旋钮 及\n主轴 编码 器 接口 手 轮 独立 按键 接口\niat GSK Link PAM\nSem ams\n四 CN74 PORT\nCED\n[ze [Ee nore\nNED\n加 加 加\n单 元 设备\n一\n型 号 IOR-21F IOR-04T IOR-44T IOR-44F 支持 第 三 方面 板\n一 可 灵活 定制 满 足 客 户 个 性 化 需求\n2a\" Wage 二 二 二 Fry\n外 观 (RO AAA\nBy: Meas\nwoe\n一 Butuu 二 一\ntate\n点 输入 /16 点 输出 点 输入 /32 点 输出 点 输入 /32 点 输出 点 输入 /32 点 输出\n规格 高 电 平 输出 低 电 平 输出 低 电 平 输出 高 电 平 输出\n路 0~10V 模 拟 电压 输出 无 模拟 电压 输出 路 0~10V 模 拟 电压 路 0~10v 模 拟 电 压 输出\n150 x95 90.2 305 90.2 305 90.2 305\n\n--- Page 26 ---\n中 加 工 中 心\nBSN\n支持 定制 木工 板材 加 工 图 形 化 编程\n设计 满足 木工 需求 的 自动 对 刀 功 能 及 专用 对 刀 面 排 钻 刀 具 功能 及 专用 对 刀 设置 页 面 支 持 代 码 调用 宏 程序 使 板材 加 工 更 易 操作 使 用 蓝图 编程 功能 直 接 通过 图 形 的 方 wel\n式 生成 轨迹 指令 可 以 方便 对 轨迹 进行 一 一 ers\nfar 插入 删 除 操作 并 直观 地 以 图 形 显示 出 so。 (X1LZ0\n来 使 得 程序 编辑 工作 变 得 更 加 轻松\neen LTT\neas Lad ir] eee\nwie\n习 即 以 图 形 化 的 方式 显示 出 来 方 便 进\nman” 代码 编辑 按 提示 输入 相关 数据 即 可\n人 一 BAN RECO\negg ome eee 直接 生成 轨迹 指令 代 码 所 支持 指令\nearn 涵盖 钻 孔 孔 攻 丝 轮 粗 轮 和\n二 一\n高 精度 插 补\nGSK 988MA 系 列 支 持 0.1um 的 最 小 插\n补 精度 输出 同 时 使 用 1ms 的 插 补 周 十 二 二 -十 -二\n期 同 时 配备 了 高 分 率 的 绝对 式 编码 上--- -十 将 系统 常用 参数 进行 分 类 方 便 参数 设 eee\naamen mae RAM.\n作 能 最 大 限度 的 保证 输出 精度 和 执行 GSK-Link 总 线 设置 、Cs 轮 廊 控 制 轴 设 crass\n效率 置 多 主轴 控制 设置 电 子 齿轮 比 设置\n前 瞻 控 制 机 床 安全 防护 和 外 接 开关 等\nGSK 988MA 系 列 采 用 了 GSK-Link 线 二\n加 连接 技术 可 以 轻松 读 写 伺服 驱动 参数\n平滑 的 加 加 速度 人 JERK 控制 功 在 CNC 界 面 中 能 方便 地 对 伺服 参数 进行\n速度 24000mm/min， 时 间 常 数 100ms 修改 外 nen! xan “ee\nJERK 控 制 功能 设计 运动 控制 算法 保证\nmeee.\n停止 阶段 的 机 床 冲击\n支持 圆 度 和 刚性 攻 丝 辅助 调试\n加 速 阶段 速度 曲线 加 速 阶段 加 速度 曲线 通过 读 取 伺服 驱动 器 内 的 运行 数据 进\n行 贺 度 测试 数据 的 分 析 和 调试 wena\n高 速 铣 削 功 能 刚性 攻 丝 调试 功能 通过 采集 伺服 攻 丝 运\n行 数据 将 数据 显示 为 误差 曲线 可 以 mee\nFeed 帮助 用 户 快速 完成 刚性 攻 丝 的 调试 缩\n通过 预 读 段 前 瞻 及 样 条 拟 合 技术 在 进 短 机 床 调试 时 间 提 高 机 床 调试 效率\n行 微小 线段 加 工时 避 免 机 床 不 断 反复\n启 停 提 高 了 加 工效 率 同 时 也 使 工 伯\nWas\nape\n让 wenn\n|e] sr] (neon RR) iene\nN12\n\n--- Page 27 ---\n中 加 工 中 心\n状态 诊断 支持 远程 监控 功能\n伺服 状态 诊断 wore mat 通过 端的 远程 监控 软件 可 在 电脑 上 对\no10 单 元 状态 诊断 eet res 多 台 系统 进行 远程 控制 状 态 监视 以 及 mae\narea, ase nuee 文件 上 传 下 载\nanes asad\nwea\naman wee\n\"ots “Me?\n50)\nWP: 法 Tt:\n支持 双 通 道 控 制 功 能 PE: wer 二 ase wed eos wer 二 wed cot\n技术 规格\n支持 铣床 双 通 道 功能 支 持 机 械 手 控制 功能 一 个 通道 运行 铣床 加 工程 序 另 一 通道 控制 机 械 手 方 便 组 成 单机 产 线 控制\n项 目 规 格\n加 控 制 轴\nG28 G91\nG04 G04 单 通道\nM100 M100 最 多 总 控制 轴 数 (包括 轴 /PMC 轴\nM101 X100\nM101 路 径 内 轴 数\nM30 ven 路 径 数\nM30 最 多 控制 主轴 数\n路 径 内 主轴 数\n轮廓 控制\n同步 混合 控制\n支持 目 动 化 生产 线 的 无 缝 接 和 人 程序 指令 进行 的 同步\n进 给 轴 同\n通过 网 关 接 入 GPC 总 控 单元 可 实现 数 倾 四 控制\n控 机 床 与 工业 机 器 人 机 械 手 等 自\nneni\n产 线 可 大 大 节省 人 力 成 本 提 高 生产\n工\n加 工效 率 meee 机 械 锁\n紧急\n超 各\n存储 行程 检测\n行程 限 位 外 部 设 定\n存储 行程 检测\na... 镜像 ie)\n倒 角\n路 径 间 干涉 检测\n\n--- Page 28 ---\nSSK888MA 系 列 床 加 工 中 心 数控 系统 定位 用 户 宏 指令 单 向 定位 路 径 间 公共 宏 指 令 变 直线 揪 补 单一 形 固 定 循环 复合 形 固定 循环 和 暂停 钻 孔 用 固定 循环 极 坐 标 插 补 小 口径 深 孔 钻 削 循 环 螺旋 线 插 补 辅助 功能 82) 多 头 螺纹 切削 第 辅助 功能 连续 螺纹 切削 辅助 功能 锁 住 变 螺 距 螺纹 切削 多 个 辅助 功能 指令 多 边 形 加 工 主轴 模拟 输出 主轴 间 多 边 形 加 工 周 速 恒定 控制 Bit 主轴 倍率 返回 参考 点 实际 主轴 速度 输出 返回 参考 点 检测 主轴 定位 返回 第 参考 点 主轴 同步 控制 法 线 方向 控制 多 主轴 控制 均衡 切削 主轴 定位 快速 进 给 速度 最 小 设 定单 位 刀具 补偿 个 数 100 个 快速 进 给 倍率 S23 HES 附加 轴 偏 填 直线 型 加 减速 刀具 直径 刀 尖 半 径 补偿 快速 进 给 线 型 加 减速 刀具 几何 磨损 补偿 切削 进 给 线 型 加 减速 刀具 偏 计数 器 输入 进 给 速度 倍率 0~150% (间隔 10% 自动 刀具 补偿 Look-ahead 刀具 补偿 测量 值 直接 输入 样 条 拟 合 刀具 寿命 管理 最 大 指令 值 +99999999 反 向 间隙 补偿 绝对 增 量 指令 快速 进 给 /切削 进 给 反 向 间隙 补偿 信 答 入 单位 存储 型 螺 距 误差 补偿 极 坐标 指令 程序 存储 容量 120MB 坐标 系 设 定 后 台 编 辑 和 工件 坐标 系 状态 显示 附加 工件 坐标 系 时 钟 功能 手动 绝对 值 OFF 程序 注释 显示 代 码 体系 M、T:A/B 报警 显示\n技术 规格 技术 规格\n标准 功能 软件 /硬件 /选项 立 无 此 功能 标准 功能 软件 /硬件 /选项 ve: 无 此 功能\n项 目 规 格 项 规 格\n\n--- Page 29 ---\nGSK\n技术 规格 安装\n标准 功能 软件 /硬件 /选项 无 此 功能\n项 目 规 格\nGSK 988MA(8.4 才 主机 面板 安装 尺寸 横 式\n报警 显示\n工作 时 间 /零件 数 显 示 0201; psn\n[Lv\n实际 主轴 旋转 数 代码 显示 国 下\n加\n存储 目录 显示\n伺服 调整 画面 四 四\n人\n参数 设 定 支援 画面\ndied\n口 口 口 口 口 口 口 口 口\n伺服 信息 画面 一\n主轴 信息 画面\n图 形 显示 83.6 户 安装 如\nGSK 988MA GSK 988MA GSK 988MA 式\n主机 BxB) 400mm 200mm 480mm 222mm 292mm 402mm\n机 床 面板 400mm 200mm 183mm 292mm 303mm\nGSK 操作 面板 安装 尺寸 text\nfl:\n出\nCoe) Cee\n所 (il\n-十 -上\n下\n\n--- Page 30 ---\nGSK 988MA 系列 铣床 加 工 中 心 数控 系统\nGSK988MA series milling machine machining center CNC system 444 F2=\neee\nGSK 988MA(10.4 寸 屏 主机 面板 安装 尺寸 横 式 GSK 988MA(10.4 TH) 主机 面板 安装 尺寸 坚 式\n用 户 安 装 加 工 图\n日 加 加 图 回回 回国 6020\n国 加 可\n区 oo000000000 soe 加 图 日 56)\n日 有\n日\n由\n用 户 安装 加 工 图 出\nAAA 图\n回回 回 固\nWEG\nGOO O80 图 回回 回\nBUS 回回 回\nGSK 988MA(10.4 寸 屏 操作 面板 安装 尺寸 横 式 GSK988MA (10-4 Sm) 操作 面板 安装 尺寸 坚 式\n下 用 户 安装 加 工\n一\n-um pare\n(at\n内 由 aly\nlad\nnnn 0-15.\n乡\n加 fon,\n大 一 一 dil\n图\nSE.\n[es\n并 下\n\n--- Page 31 ---\nGSK 988MA 系列 铣床 加 工 中 心 数 控 系 统 GSK 980MD 钻 铣床 数控 系统\nGSK988MA series milling machine machining center CNC system GSK 980MDi drilling and milling machine CNC system\nFAR 产品 概述\nGSK 988MA 配 威 达 VMC850 加 工 中 心 GSK 980MDi 钻 铣床 数控 系统\nGSK 980MDIZGSK 980MD 系 列 产品 家 族\n技术 特点 加 工 样 例 中 的 成 员 是 GSK 980MDc 的 升级 产品\nGSK\nts: 零件 加 工 及 模具 加 工 线 控制 技术 标 配 总 线 式 伺服 驱动 单元 及 绝对 式 BER tee\n铣 钻 刚 性 攻 丝 复合 加 工 le. 编码 器 伺服 电机 实 现 了 轴 联 动 直线 最 fend son\n能 进行 模具 加 工 小 指令 单位 0.1um 最 高 运行 速度 100m/min 的\n配置 何 服 主轴 高 速 高 精 运动 控 制 可 扩展 /O， 可 适 配 圆 盘 式 刀\n(51) 库 斗 等 式 刀 库 和 炮塔 刀 库 满 足 加工 中 心 和 外 CoP\norn\n四 凸 件 玫瑰 花 的 需要 和\n技术 特 点 GSK 980MDi 横 式 8.4 寸 GSK 980MDi 式 8.4”GSK 980MDi 分 体式 8.4\nGSK-Link 工 业 以 太 网 总 线 控制\n技术 特点 加 工 样 例 轴 联 动 直线 最 小 控制 精度 0.1hm， 最 高\n移动 速度\n国 小 线段 模具 加 工 wer 在 线 式 CAM 功 能 读 取 DXF 文 件 生成 加 工程 序 {ae\n使 用 look-ahead 前 瞻 控 制 技术 高 次 样 他 ‘=~ 支持 伺服 参数 在 线 配 置 伺 服 状态 实时 监测\n具有 编程 向 导 平 面 铣削 自动 编程 功能 gag Firs\n配置 电 主 轴 进 给 电机 使 用 位 绝对 式 编 ooo\n码 器 支持 单 元 扩展 可 适 配 圆 盘 式 斗 符 刀 库 wag ede dood\nKame peg Rood\n欧洲 模具 支持 显示 界面 二 次 开发 自 定义 页 面 CELE: aaa anus\naco\n木工 板材 机 支持 刚性 攻 丝 圆 柱 插 补 以 及 分 度 台 控制\n支持 高 速 小 线段 程序 模具 加 工 iad Hare Gaga\n支持 周边 轴 控 制 共 有 个 周边 轴 控 制 组 人\nCorde\nOx, mae! -一 一 一 一 支持 一 键 断 点 数据 恢复\n-SN TEN? GAS 中\n技术 特点 支持 刚性 攻 贺 度 波形 分 析 GSK 980MDi 横 式 10.4 GSK980MDi 式 10.4\n具有 扭矩 保护 功能\n自动 对 刀 专 用 界面\nSEE HET:\n三 一 启 停 平滑 高 速 加 工 在 线 式 CAM 功 能\n将 CAD 文 件 导入 到 系统 以 后 系 统 可 对 此 文件 进行 显示 并 可 进行 后 置 处 理 无 需 编 程 可\n人\n\n--- Page 32 ---\nKRIS\nGSK\n量 技术 特点 技术 特点\n高 速 高 精 控制 固定 循环 /复合 循环 指\n采用 GSL-Link 工 业 以 太 网 总 线 最 高 运行 速度 100m/min。 标 配 系 列 伺服 装置 及 高 分 辨 率 绝对 式 编码 器 的 伺服 电机 可 连接 光栅 系统 提供 多 种 固定 循环 和 复合 循环 指令 以 简化 编程 通 过 这 些 指令 可 实现 钻 孔 负 圆 /矩形 槽 粗 铣 全 圆 /矩形 精 铣 直 线\n尺 磁 阻 编码 器 磁 圆 光栅 实现 进 给 轴 全 闭环 控制 和 高 精度 轴 控制 SINAC EEG FLAS\n直线 连续 钻 孔 指 令 或 指 令 矩形 连续 钻 孔 (G140/G141) ate\n在 指定 的 直线 上 进行 连续 钻 孔 ee” [Po 在 矩形 的 各 个 边 进行 连续 钻 孔\nate\nGROOOO tal AREY HMR\nRES\nGSK-Link 总 线\n棋盘 孔 循环 (G144)\n在 指定 的 圆 进行 连续 钻 孔 在 轴 的 平行 方向 进行 等 距离 的 间\n隔 性 钻 孔\nSig Sw’\niad\nFil fal REZ ——\"\n刚性 攻 丝\nIOR 系列 单元 通过 攻 丝 轴 和 主轴 之 间 的 插 补 进行 攻 丝 (G76/G82/G85/G86/G87/G88/G89)\n有 高 速 /标准 深 孔 方式 可 供 选 择 WH,\n高 速 小 线段 模具 加 工\ngGox gel\n针对 UG，Mastercam 等 编程 软件 生成 [Get esc\nG17 G40 Goo 所 Fe’\n的 小 线段 程序 实 现 高 速度 高 精度\nC72,\n226. 126\nP03, cut\n6207149. ree. 238\n“4, 以 指定 的 参数 数据 作 矩形 运动 轨迹 中 心 点 开始 加 工 向 外 以 加 的 形式 进\n直至 加 工 出 编程 尺寸 的 矩形 四 行 逐 级 加 工 最 后 形成 一 个 贺\nYoo. ald\nX21. WT, ONT\nx6. T2149, ese\nX29, 243\n和\nX41. 79771, 028\nX42.\niad,\n小 线段 程序\n\n--- Page 33 ---\nGSK 980M\n技术 特点\n周边 轴 控 制 一 键 断 点 恢复\n周边 轴 控 制 如 同 多 个 独立 的 通道 控制 可 以 独 程序 中 断 以 后 只 需 通 过 点 数据 恢复 ”按键 一 键 恢 复 中 断 前 的 状态 从 而 实现 对 工件 的 继续 加 工\n立 编程 或 和 主 程序 混合 编程\n了\n(seen)\ntte\n人 6.0 one\n一 人 ome\nent\nRez 7-30 enna. __nel\neos\neee\n加 工 中 断 断 点 恢复 ,从 中 断 处 继续 加 工 加 工 完成\n旋转 工作 台\n一 次 装 夹 实现 个 不 同 程序 同时 加 工 效 率 提 高 倍\n扭矩 保护 功能\n斜面 加 工\n在 钻 孔 时 检测 到 扭矩 过 大 系 统 返回 初始 平面 和 加 工 并 提示 客户 进行 刀具 检查\n支持 在 上 进行 钻 孔 攻 丝 及 铣 前 加 工 rem\n是 fate ”mm\n每 pad 区\non™\n环卫\n检测 扭矩 过 大 返回 初始 平面 系统 暂停 和 提示\n波形 分 析\n图 表 编 程 功 能 通过 读 取 反馈 的 电机 数据 对 刚性 攻 丝\n国度 进行 波形 分 析 并 对 伺服 参数 调试\nERT 提供 依据 weve\n程序 使 编程 变 得 简单 快捷\n人\neam eee TO)\nEY)\nNo” 站\n一 站\n攻 丝 波形 分 析 度 波形 分 析\n\n--- Page 34 ---\nGSK\n技术 特点 技术 规格\n适 配 高 速 刀 库 项 目 规 格\n标准 梯形 图 支持 圆 盘 式 刀 库 斗 符 式 刀 适 配 多 圈 绝 对 位 置 编码 器 的 伺服 电机\n库 炮 塔 刀 库 通 过 参数 进行 选择 “at 机 床 掉 电 后 绝对 坐标 系 自动 恢复\n总 线 功能 伺服 参数 在 线 修改\n伺服 状态 在 线 诊断\n一 一 人 上 操作 日 志 运 行 日 志\n远程 监控 故 障 诊断 功能\n下 主轴 转速 可 由 代 码 或 PLC 信 号 给 定 转 速 范围 0npm~ 99999rpm (sa)\n主轴 倍率 50% 120% 共 级 实时 修 调\n主轴 功能 路 10V 模 拟 电压 输出\n支持 模拟 主轴 型 换 档 和 型 换 档 功 能 又 性 攻 丝 /刚性 攻 丝\n盘 刀 库 斗 等 刀 库 路 主轴 编码 器 反馈 主 轴 编 码 器 线 数 可 设 定 或 5000pyr\n刀具 长 度 补偿 (AIRE) ，32 组\n刀具 功能 刀具 磨损 补偿 组\n机 床 调试 功能 刀 半径 补偿 (CH)\n两 级 PLC 程 序 最 多 5000 步 第 级 程序 刷新 周期 8ms\n机 床 功能 调试 将 数控 机 床 的 调试 步骤 按 功 rater 种 基本 指令 ，31 种 功能 指令\n能 分 类 使 调试 工作 变 得 简单 快 捷 使 PLC 功 能 PLC 程 序 在 线 显 示 实 时 监控 支 持 PLC 警 告 和 PLC 报 敬\n机 床 调试 工作 不 再 是 少数 人 的 专 利 HAO: 入 /38 答 出\n可 扩展 串 行 单 元 选 购 件 IOR-44T: 点 输入 、32 点 输出 路 模拟 电压 输出\n辅助 功能 特殊 代 码 (MOO. M01, M02, M30, M98, M99) 其 余 代 码 由 PLC 定 义\n-we 程序 容量 64M、10000 个 程序 含 子 程序 宏 程序\n编辑 方式 全 屏幕 编辑\n程序 的 存储 与 编辑 编辑 功能 程 序 /程序 段 字 检索 删除 复 制 粘 由\nMDI 许 输入 运 行 个 程序 自\n精细 的 调试 分 类 直观 的 调试 选项 支持 宏 程序 程序 调用 人 允许 重子 程序 套\n技术 规格 计算 器 在 线 编程 向 导 在 线 式 钻 孔 CAM 功 能 平 面 铣削 自动 编程 功能\n程序 检查 功能 轨迹 预览 图 形 仿真 空 运行 机 床 锁 辅 助 功能 锁 单 段 运行\n简化 编程 功能 固定 循环 复 合 循环 钻 孔 循 环 刚 性 攻 丝 自 动 倒 角 语 句 式 宏 指 令 编程 分 度 台 分 度 功 能\n项 目 规 格 能 反 向 间 补偿 mm~2 或 inch~0.2 inch) 反 向 间 隐 方式 频 率 由 参数 设 定\n最 大 控制 轴 数 轴 选 配 轴 记忆 型 螺 距 误差 共 1024 个 补偿 点 各 轴 补 偿 点 数 参数 设 定\n控制 轴 数 控制 轴 数 轴 支持 中 文 英 文 俄 文 等 多 种 语言 显示\n最 大 联动 轴 数 轴 直线 插 补 轴 螺旋 线 插 补 轴 圆 插 补 人 机 界面 加 工 轨迹 显示 加 工 轨迹 实时 放大 缩 小 平 移 视 角 换\n局 部 坐标 系 机 床 坐 标 系 工 件 坐标 系 1-6 (G54~G59) 位 置 程 序 刀 补 报 警 参 数 设 置 图 形 诊 断 梯 图\n系 坐标 平面 选择 操作 方式 编辑 自 动 录 入 机 械 回 零 手 脉 单 步 手 动 _DNC\n及 尺寸 位 置 指令 范围 99999999 最 小 输入 单位 级 操作 权限 管理\n绝对 增 昌 编程 英 制 /公制 转换 直 线 轴 回 转轴 操作 管理 次 限时 停机\n个 指 令 包 括 快速 定位 插 补 自 动 倒 角 刀 具 补偿 公 英制 输入 坐 标 旋转 比 例 缩放 镜 像 语 名 找 工件 中 心 点\n准备 功能 式 宏 指 令 宏 程序 调用 跳 转 循 环 指令 小 线段 前 瞻 竺 程序 开关 参 数 开关\n快速 移动 速度 mm/min ~100000 mm/min USB: 盘 文件 操作 盘 文件 直接 加 工 支 持 PLC 程 序 系 统 软件 盘 升级\n快速 倍率 F0、25%、50%、100% 共 四 级 实时 修 调 通讯 功能 RS232: 零件 程序 参 数 等 文件 双向 传输 支 持 PLC 程 序 更 新\n进 给 功能 切削 进 给 速度 mm/min ~15000 mm/min LAN: 远程 文件 传输\n进 给 倍率 150% 共 十 六 级 实时 修 调 安全 功能 紧急 停止 硬 件 行程 限 位 软 件 行程 检查 数 据 备份 与 恢复\n快速 移动 加 减速 直线 型 型 切削 进 给 加 减速 型 直 线 型 电气 接口 点 数字 输入 输出 接口 路 编码 器 接口 路 手 轮 接口 路 主轴 模拟 接口 、RJ45 网 口 、GSK-LINK 网 口\n\n--- Page 35 ---\n钻 铣床 数控 系\n的 夕 床 数控 系统\n技 术\n系统 外 形 安 装 尺寸\n项 目 规 格\nGSK 980MDi 宽 高 深 420x260x150mm GSK 980MDi 横 式 外 形 安 装 尺 寸 8.4 英 寸\n8.4 英 十 GSK 980MDi-V 宽 高 深\n外 形 尺 十 GSK 980MDi-H 高 深 400x400x150mm\nGSK 980MDi ik) 480x405x150mm [一 一\n10.4883 乡\nGSK 980MDi-V 宽 高 深\ncle) Tika\n代 码 表 乡 PF)\nRROD (Cees (ees\ntee ‘ari\n代码 功能 代码 功能 代码 功能\n一 一\n*G00 定位 (快速 移动 G52 局 部 坐标 系 设 定 G92 坐标 系 设 定 [aa\nG01 直线 插 补 (切削 进 给 G53 选择 机 床 坐标 系 *G94 ”每 分 钟 进 给 用 户 安装 加 工 图\nG02 顺 时 针 圆 驱 /螺旋 线 插 补 G54.1 附加 工件 坐标 系 G95 每 转 进 给\nG03 SOAR AEE G54 工件 坐标 系 G98 ”在 固定 循环 中 返回 初始 平面 Hn\"\nG05.1 轮廓 控制 G55 工件 坐标 系 G99 在 固定 循环 中 返回 点 平面\nG07.1 圆柱 插 补 G56 工件 坐标 系 G110 逆 时 针 国 凹 槽 内 粗\n一\nG04 暂停 准 售 G57 工件 坐标 系 G111 顺 时 针 国 凹 槽 内 粗 一 一\nG10 可 编程 数据 输入 G58 工件 坐标 系 G112 逆 时 针 全 内 精 铣\n一 NAI\n“c15 取消 极 标 指 令 方丈 G59 坐标 系 G113 MENS} GSK 980MDi-V 竖 式 外 形 安装 尺寸 (8.4 英寸\nG16 极 坐标 指令 方式 开始 G65 宏 指令 G114 (an\n*G17 平 面 选 择 G66 宏 程序 模 态 调用 G115 RES\n(rr\nG18 平面 选择 *G67 宏 程序 模 态 调用 取消 G116 ARTEL\nG19 平 面 选择 G68 坐标 旋转 开始 G117 RAS\nG20 英制 输入 *G69 坐标 旋转 取消 G126 BPE 用 户 安装 开 马 图\nG21 公制 输入 G73 高 速 深 孔 加 工 循环 G127 BRB\nG28 返回 参考 点 G74 左旋 攻 丝 循环 G132 逆 时 针 外 矩形 粗\nG29 从 参考 点 返回 G76 精 循环 G133 顺 时 针 外 矩形 粗 铣 ate 和\nG30 返回 第 2,3,4 参 考点 *G80 取消 固定 循环 G134 逆 时 针 和 矩形 凹 模 粗 sre\nhac\nG31 跳跃 机 能 G81 钻 孔 循环 (点 钻 循环 G135 NAS EAM AES wale 2121 引\n*G40 取消 刀具 半径 补偿 G82 钻 孔 循环 梯 孔 循环 G136 WRF quad\nG41 刀具 半径 左 补 偿 G83 深 孔 钻 循环 G137\nG42 刀具 半径 右 补 偿 G84 攻 丝 循环 G138 ERS Ceara mem\nRZ)\nG43 刀具 长 度 正 向 补偿 G85 孔 循环 G139 RAS\narene\nG44 刀具 长 度 负 向 补偿 G86 钻 孔 循环 G140 顺 时 针 形 连 续 钻 ows\n*G49 取消 刀具 长 度 补偿 G87 背负 G141 逆 时 针 矩形 连 续 钻 孔\n“G50 een Gas G142 NAS\nG51 比例 缩放 开始 G89 SIL G143 逆 时 针 形 连续 钻\n.G50.1 .Ge0 G144 模 各 外 了\n一 和\nG51.1 设置 可 编程 镜像 G91 SERIE\n\n--- Page 36 ---\nGSK 980MDi 钻 铣床 数控 系统\nGSK 980MDi drilling and milling machine CNC system 444\neee\n系统 外 形 安装 尺寸\nGSK 980MDi-H 分 体式 编辑 面板 安装 尺寸 (8.4 英寸 GSK 980MDi 横 式 外 形 安装 尺寸 (10.4 英 寸\n人\n本 口 口 口 口 口 ane\n得] 四 日 串口 口\nmic Bal\nOIE] GEILE)\nfie\n天 三 三 三 三 三 本\n用 户 安装 加 工 图 @©1%\nmei\nare\nGSK 980MDI-H 分 体 或 作 面板 《8.4 英 十\npls\n站\n16x\nRAE 有\nGo)\n至\n用 户 安装 加 工 图 全 一 一 一\nores 一\n[一 一 一 二\n\n--- Page 37 ---\nGSI SBM\n安装 尺寸 FAR\nGSK 980MDi 竖 式 外 形 安 装 尺寸 (10.4 英 寸 GSK 980MDi 配 常州 二 机 立 式 加 工 中 心\n\"Zk\n>170 和\n一\nEre\nbes\n技术 特点\nPG) 总 线 连 接 伺 服 主轴 ，XYZ 进 给 轴\n配 斗 等 圆 盘 刀 库\ntel 一 次 装 夹 连 续 完成 钼 孔 攻 丝 等 多 种 工序 的 加 工\n一 一 一 一 一 一\nFEES SSS\nGas Saas Gee\n同 国 中国\nif!\nOG: 类 型 ;标准 钻\naie 机 床 类 型 标准 钻 铣床\nmil 技术\n一 mess\n各 轴 相 关 参 数 ”移动 距离 移动 轴 扭 矩 DHE 电机 型 号 驱动 快速 移动\n轴 700mm 15N.m 0.0001mm 130SJTE-M150D GR2100 15000mm/min\n轴 400mm 15N.m 0.0001mm 130SJTE-M150D GR2100 15000mm/min\n轴 600mm 15N.m 0.0001mm 130SJTE-MZ150D GR2100 15000mm/min\nS/CS 轴 360° 48N.m 0.0001° ZJY208A-7.5B GR3075 8000mm/min\n\n--- Page 38 ---\n7699 com com 9008 一 [73 Bee 满 加 工 中心 和 专用 机 床 的 需要 人 ‘aaueaeaa case) ate 72)\nSSK880MDc 钻 铣床 数控 系统 444 Bite 二 nae: men 自动 找 中 心 点 等 功能 支 持 11/O 单 元 扩 eee 所 昌 一 二 gin aC, 展 可 适 配 回 盘 式 刀 库 和 斗 式 刀 库 Scans 高 性 价 比 的 GSK 980MDc 系 列 产品 是\nGSK 980MDc 钻 铣床 数控 系统 平面 铣削 取 点 加 工 能 在 线 式 编程 向 导 平 面 铣 自动 编程 eet\n轴 联 动 控制 具 有 横 式 竖 式 及 分 读 形 或 者 加 点 可 直接 生成 加 拍档\n三 种 结构 采 用 8.4 BELCD, GSK 980MDc 模 式 8.4” GSK 980MDc 分 体式 8.4 GSK 980MDc 竖 式 8.4 [3] 定 循环 /复合 循环 指 令\n系统 提供 多 种 固定 循环 和 复合 循环 指令 以 简化 编程 通 过 这 些 指令 可 实现 钻 孔 孔 攻 丝 直 线 /矩形 形 连续 钻 孔 刚 性 攻 丝 贺 四 形\nDas.\n轴 联 动 控制\n最 小 控制 精度 0.1u 最 高 移动 速度 60m/min;\nTe,\n可 实现 主轴 定向 刚 性 攻 丝 圆 柱 插 补 以 及 分 度 台 控制\n内 置式 PLC， 梯 形 图 在 线 显示 实 时 监控 支 持 单 元 扩展 可 适 配 圆 盘 式 和 斗 等 式 刀 库\n具备 在 线 是 钻 孔 CAM 功 能 在 线 式 编程 向 导 平 面 铣 自动 编程 自 动 找 工件 中 心 等 功能 编 程 方便 操 作 快 捷\n程序 段 执行 和 一\n支持 个 工件 坐标 系 坐 标 旋转 比 例 缩放 镜 像 自 动 倒 角 语 句 式 宏 指 令 提 供 种 固定 循环 指令 和 种 复合 循环 指令\n编程 灵活 简 便\n40M 程 序 存储 空间 ，10000 个 零件 程序 支 持 盘 程序 加 工 和 串 行 通讯 DNC 加 工\n级 操作 权限 管理 ，32 次 限时 停机 设置\n8.4 寸 真 彩 LCD， 支 持 中 文 英 文 俄 文 等 多 语种 显示\n在 线 式 CAM 功 能 在 线 式 编 程 向 导\n将 CAD 文 件 导 入 到 系统 以 后 系 统 可 对 此 文件 进行 显示 并 可 进行 后 处 理 无 需 编程 可 自动 生成 钻 孔 类 型 的 加 工程 序 用 户 不 需 记忆 指 令 格式 编 程 向 导 功能\n逐步 提示 指令 信息 帮 助 完成 指令 编辑\nCook one\n避免 编辑 错误 或 遗漏。\n里 用 时 里\n一\n了\n9900000 gomn ret\nAALONAGOO 一\nOS!\n一\n\n--- Page 39 ---\nGSK\nmeen\n最 大 控制 数 轴 轴\n最 大 联动 轴 数 轴 直线 插 补 轴 螺旋 线 插 补 轴\n性 攻 丝 加 工 精度 和 效率 更 加 高 局 部 坐标 系 机 床 坐 标 系 工 件 坐 标 系 1-6 (G54~G59) 附 加 工件 坐标 系 (P1~P48)\n位 置 指令 范围 ，+99999999 最 小 输入 单位\n站 绝对 增 编 程 英 制 /公制 转换 直 线 轴 回 转轴\n全 个 指 令 包 括 快速 定位 插 补 自 动 角 刀 具 补偿 公 英制 答 入、 坐标 旋转 比 例 缩放 镜 像\n语句 式 宏 指令 宏 程序 调用 转 循 环 指 令 等\n动 速度 (IS-B) Omm/min ~60000 mm/min0.1 (IS-C\n一 aise\n给 进 功能 快速 倍率 F0、25%、50%、100% 共 四 级 实时 修 调\n人 切削 进 给 速度 mm/min ~30000 mm/min0.15 级 (1IS-C\nmm/min ~24000 mm/min\n进 给 倍率 一 150% 共 十 六 级 实时 修 调\n主轴 转速 可 由 代 码 或 PLC 信 号 给 定 转 速 范围 0rpm 9999rpm\n主轴 50% 1209% 共 级 实时 修 调\n主轴 功能 路 10V 模 拟 电 压 输出\n自动 找 中心 点 支持 模拟 主轴 型 换 档 和 型 换 档 功能 柔性 攻 丝 /刚性 攻 丝\n路 主轴 编码 器 反馈 主 轴 编码 器 线 数 可 设 定 或 5000pyr\n刀具 长 度 补偿 (ARH) 328; 刀具 磨损 补偿 组\n在 对 矩形 和 圆 件 对 刀 操 作 时 只 需 输 入 刀 尖 半径 补偿 CH)\n几 个 必要 的 测量 点 坐标 系 统 便 可 自动 计算 系 (ante wens 辅助 功能 特殊 代 码 (M00、M01、M02、M30、M98、M99) 代 码 由 PLC 定 义\n出 矩形 或 圆 工件 中 心 点 的 机 床 坐 标 并 写 MM] 两 级 PLC 程 序 最 多 5000 步 第 级 程序 刷新 周期 8ms\n入 坐标 系 中 PLC 程 序 在 线 显示 实 时 监控 ;支持 PLC 警 告 和 PLC 报 警\n可 存储 多 个 PLC 程 序 由 参数 选择 当前 运行 的 PLC 程 序 标 准 PLC 程 序 支持 圆 盘 式 刀 库 和 斗笠 式 刀 库\n基本 |/O 输 入 /36 输 出\nSees nes 可 扩展 串 行 单 元 (HERE) IOA-O1T 点 输入 、16 点 输出 路 模拟 电压 输出\nIOA-02T 点 输入 、24 点 输出 路 模拟 电压 输出 路 模拟 电压 输入\n“we 全 屏幕 编辑 程序 容量 40M、10000 个 程序 含 子 程序 宏 程序\nMDI 允 许 输入 运 行 个 程序 段\n支持 宏 程序 子 程序 调用 允 许 重子 程序 说 套\n计算 器 在 线 编程 向 导\n亡 便 灵活 的 PLC 简化 编程 功能 固定 循环 复 合 循环 钻 孔 循环 刚 性 攻 丝 自 动 倒 角 语 句 式 宏 指 令 编程 分 度 台 分 度 功能\n能 反 向 间隙 补偿 mm~2 (或 inch~0.2 inch 反 向 间 补偿 方式 频 率 由 参数 设 定\n在 线 监控 当前 工作 梯形 图 用 盘 进行 梯 图 记忆 型 螺 距 误差 补偿 共 1024 个 补偿 点 各 轴 补 偿 点 数 参数 设 定\ner. iy. 8.4 叶 真 彩 LCD，7 个 软 功能\nGane aia 支持 中 文 英 文 俄 文 等 多 种 语言 显示\nMB,\ntee 位 置 程 序 刀 补 报 警 参 数 设 置 图 形 诊 断 梯 图\n操作 方式 编辑 自 动 录 入 机 械 回 零 手 脉 单 步 手 动 、DNC\n操作 管理 级 操作 权限 管理 ;32 次 限时 停机\n程序 开关 参 数 开 关\nECO) ante USB 盘 文件 操作 盘 文件 直接 加 工 支 持 PLC 程 序 系 统 软件 盘 升级\nRS232 零件 程序 参 数 等 文件 双向 传输 支 持 PLC 程 序 更 新\n\n--- Page 40 ---\nSSK880MDc 钻 铣床 数控 系统 444\nskd\nGSK 980MDC 外 形 安装 尺寸 GSK 980MDc-V 外 形 安 装 尺 十\naverse\nist\n一 一 一 -一 “TH\n用 户 安装 开 孔 图\n乡 2500.2\n_—™\nALP aise\n过 一\nthe\n[sees\nGSK 980MDc-H 外 形 安 装 尺寸\n站\n二 应 用 案例\n(45 ees\nGSK 980MDc 配 银川 大 河 立 式 钻 铣 中 心\n时 技术 特点\n用 户 安装 加 工 图 编程 简单 易 于 操作\nmar 适 配 圆 盘 刀 库\n机 床 类 型 标准 钻 铣床\nifr»\nTay 技术 参数\n各 轴 相 关 参 数 ”移动 距离 ”定位 精度 电机 型 驱动 快 移 速 度\nTE]\n一 轴 850mm 15N.m 0.001mm 130SJT-M150D GS2050 ”15000mmy/min\n轴 650mm 15N.m 0.001mm 130SJT-M150D GS2050 15000mmy/min\naff 二 -于 510mm 15N.m 0.001mm 130SJT-MZ150D GS2050 ”10000mm/min\n一 一 一\n360° 48N.m 0.001° ZJY208-7.5B-B3 GS3075 8000mm/min",
    "file_path": "D:\\llm-test\\QAGenPipelinesX_lightrag\\working\\processed\\01系统综合-铣削.txt",
    "create_time": 1764298454,
    "update_time": 1764298454,
    "_id": "01系统综合-铣削"
  }
}